{
  "day": {
"WoodStrong": [
  "How can strong personal energy shape the way someone approaches daily challenges?",
  "In what way might resilience help a person maintain long-lasting relationships?",
  "How can steady growth in character influence a person’s career choices?",
  "What happens when creativity guides someone’s problem-solving in life?",
  "How might emotional balance improve the way a person handles stress?",
  "In what way does having a strong inner drive affect long-term success?",
  "How can adaptability help someone overcome sudden changes in life?",
  "What happens if a person’s vitality supports both mental and physical health?",
  "How might persistence shape a person’s ability to achieve wealth or stability?",
  "In what way does personal strength guide how a person inspires others?"
],
"WoodModerate": [
  "How can balanced energy support both work and personal life?",
  "In what way might steady progress influence long-term goals?",
  "How can patience shape the way a person handles new opportunities?",
  "What happens when creativity is used in practical daily decisions?",
  "How might calm thinking improve the way someone solves conflicts?",
  "In what way does a measured approach help in building stability?",
  "How can cooperation with others bring positive results in life?",
  "What happens if a person maintains steady habits over time?",
  "How might moderate persistence lead to gradual achievements?",
  "In what way does balance between effort and rest improve well-being?"
],
"WoodWeak": [
  "How can lack of energy affect a person’s ability to stay consistent?",
  "In what way might hesitation limit someone’s opportunities?",
  "How can low resilience shape the way a person handles setbacks?",
  "What happens when focus is easily lost in important tasks?",
  "How might weak motivation influence long-term ambitions?",
  "In what way does self-doubt affect personal decision-making?",
  "How can fragile health change the way a person lives daily life?",
  "What happens if someone avoids challenges out of fear?",
  "How might dependence on others reduce personal growth?",
  "In what way does lack of persistence impact future stability?"
],
"FireStrong": [
  "How can strong passion drive a person’s success in life?",
  "In what way might confidence inspire others around someone?",
  "How can high energy improve the way challenges are faced?",
  "What happens when enthusiasm fuels daily decisions?",
  "How might courage shape the way a person takes risks?",
  "In what way does strong willpower lead to breakthroughs?",
  "How can joy and positivity affect a person’s relationships?",
  "What happens if determination is kept even in hard times?",
  "How might leadership skills influence a group’s direction?",
  "In what way does bold action create new opportunities?"
],
"FireModerate": [
  "How can balanced enthusiasm keep life steady and enjoyable?",
  "In what way might a calm confidence help in social settings?",
  "How can controlled passion guide better career choices?",
  "What happens when energy is expressed in creative ways?",
  "How might steady motivation improve a person’s daily routine?",
  "In what way does thoughtful courage prevent reckless actions?",
  "How can warmth in personality improve trust with others?",
  "What happens if excitement is balanced with patience?",
  "How might measured risk-taking open gradual opportunities?",
  "In what way does steady optimism improve overall outlook?"
],
"FireWeak": [
  "How can low confidence affect a person’s ability to take action?",
  "In what way might lack of energy limit daily achievements?",
  "How can weak enthusiasm change the way someone approaches work?",
  "What happens when motivation quickly fades under pressure?",
  "How might fear of failure stop a person from trying new things?",
  "In what way does hesitation affect personal progress?",
  "How can lack of courage weaken important decision-making?",
  "What happens if optimism is lost in difficult times?",
  "How might emotional instability reduce trust in relationships?",
  "In what way does low drive prevent a person from reaching success?"
],
"EarthStrong": [
  "How can strong stability shape a person’s approach to life?",
  "In what way might patience help build lasting achievements?",
  "How can reliability improve the way someone is trusted by others?",
  "What happens when determination supports long-term goals?",
  "How might discipline influence a person’s personal success?",
  "In what way does steady focus bring clarity in decision-making?",
  "How can strong self-control help manage daily challenges?",
  "What happens if persistence is applied to every step in life?",
  "How might loyalty strengthen a person’s closest relationships?",
  "In what way does inner strength create a solid foundation for growth?"
],
"EarthModerate": [
  "How can balanced discipline help someone manage both work and rest?",
  "In what way might steady effort support slow but sure success?",
  "How can being dependable improve everyday relationships?",
  "What happens when calm thinking guides important choices?",
  "How might moderation prevent mistakes in personal decisions?",
  "In what way does balanced self-control support well-being?",
  "How can careful planning bring gradual progress in life?",
  "What happens if consistency is maintained in small tasks?",
  "How might fairness improve the way someone is respected?",
  "In what way does practical thinking lead to stability?"
],
"EarthWeak": [
  "How can lack of stability affect a person’s daily confidence?",
  "In what way might indecision slow down personal growth?",
  "How can weak discipline change the way goals are achieved?",
  "What happens when focus is easily broken during challenges?",
  "How might low determination limit success over time?",
  "In what way does inconsistency affect trust in relationships?",
  "How can dependence on others reduce personal strength?",
  "What happens if planning is always avoided or delayed?",
  "How might weak self-control cause repeated mistakes?",
  "In what way does lack of patience affect future results?"
],
"MetalStrong": [
  "How can strong willpower shape a person’s path in life?",
  "In what way might courage help overcome personal struggles?",
  "How can clear thinking improve the way choices are made?",
  "What happens when determination is used to face challenges?",
  "How might strong discipline support long-term success?",
  "In what way does confidence influence personal relationships?",
  "How can firm values guide a person through tough times?",
  "What happens if inner strength is applied in daily decisions?",
  "How might resilience help someone rise after failure?",
  "In what way does strong focus create stability in life?"
],
"MetalModerate": [
  "How can balanced confidence improve a person’s growth?",
  "In what way might steady self-discipline support daily routines?",
  "How can fair judgment improve relationships with others?",
  "What happens when determination is applied with patience?",
  "How might calm courage prevent mistakes in tough situations?",
  "In what way does measured willpower keep life steady?",
  "How can thoughtful decisions shape a person’s progress?",
  "What happens if resilience is balanced with flexibility?",
  "How might a moderate drive encourage gradual success?",
  "In what way does fairness help maintain trust in life?"
],
"MetalWeak": [
  "How can lack of confidence affect a person’s decision-making?",
  "In what way might weak willpower limit personal growth?",
  "How can low resilience change how challenges are faced?",
  "What happens when discipline is easily broken?",
  "How might hesitation prevent a person from reaching goals?",
  "In what way does self-doubt affect relationships with others?",
  "How can fragile determination slow down long-term success?",
  "What happens if clear judgment is missing in daily life?",
  "How might lack of focus create repeated setbacks?",
  "In what way does weak courage hold back personal progress?"
],
"WaterStrong": [
  "How can strong intuition guide a person’s daily choices?",
  "In what way might adaptability help someone handle change?",
  "How can clear communication improve personal relationships?",
  "What happens when creativity flows into problem-solving?",
  "How might emotional depth shape the way life is experienced?",
  "In what way does flexibility support success during uncertainty?",
  "How can curiosity open doors to new opportunities?",
  "What happens if resilience is combined with imagination?",
  "How might sensitivity improve the way someone connects with others?",
  "In what way does resourcefulness help overcome challenges?"
],
"WaterModerate": [
  "How can balanced adaptability help in managing daily life?",
  "In what way might steady communication support healthy relationships?",
  "How can calm intuition shape personal decision-making?",
  "What happens when creativity is expressed in measured ways?",
  "How might emotional balance improve resilience under stress?",
  "In what way does thoughtful flexibility prevent mistakes?",
  "How can steady curiosity support gradual growth?",
  "What happens if imagination is kept practical?",
  "How might balanced sensitivity improve trust with others?",
  "In what way does moderate flow of ideas guide personal progress?"
],
"WaterWeak": [
  "How can lack of adaptability affect the way life changes are handled?",
  "In what way might poor communication create misunderstandings?",
  "How can weak intuition impact personal decision-making?",
  "What happens when creativity is easily blocked?",
  "How might emotional instability affect close relationships?",
  "In what way does fear of change limit personal growth?",
  "How can lack of resilience make challenges harder to face?",
  "What happens if curiosity fades in important situations?",
  "How might weak imagination reduce problem-solving ability?",
  "In what way does over-sensitivity create repeated struggles?"
]
  },
  "hour": {
"WoodStrong": [
  "How can strong imagination shape a person’s inner world?",
  "In what way might creativity influence the legacy someone leaves?",
  "How can resilience help raise children or guide the next generation?",
  "What happens when personal growth continues even in later life?",
  "How might strong inner energy inspire new ideas and projects?",
  "In what way does steady determination support future generations?",
  "How can personal vitality improve experiences in later years?",
  "What happens if inner strength is passed on through teaching?",
  "How might curiosity shape the way someone creates lasting contributions?",
  "In what way does persistence guide the building of a meaningful future?"
],
"WoodModerate": [
  "How can balanced creativity help in guiding children or students?",
  "In what way might steady habits support life in later years?",
  "How can measured resilience improve family stability?",
  "What happens when inner imagination is expressed in daily routines?",
  "How might calm persistence shape a person’s legacy?",
  "In what way does practical creativity support long-term projects?",
  "How can balanced energy improve inner peace in older age?",
  "What happens if curiosity is explored in simple, steady ways?",
  "How might cooperation with others strengthen family ties?",
  "In what way does moderate growth support a fulfilling later life?"
],
"WoodWeak": [
  "How can lack of creativity affect a person’s sense of legacy?",
  "In what way might weak persistence reduce long-term achievements?",
  "How can fragile energy shape later stages of life?",
  "What happens when curiosity fades with age?",
  "How might low resilience make parenting or guiding others harder?",
  "In what way does hesitation limit a person’s creative output?",
  "How can weak vitality reduce joy in older years?",
  "What happens if self-doubt prevents leaving behind lasting contributions?",
  "How might poor consistency affect trust with family members?",
  "In what way does lack of imagination narrow future possibilities?"
],
"FireStrong": [
  "How can strong passion shape the way a person inspires future generations?",
  "In what way might confidence influence the legacy someone leaves behind?",
  "How can high energy improve the way inner dreams are pursued?",
  "What happens when enthusiasm fuels creative projects in later life?",
  "How might strong courage help guide children or younger people?",
  "In what way does bold thinking support long-term contributions?",
  "How can lasting joy brighten a person’s later years?",
  "What happens if determination is passed on through teaching or mentoring?",
  "How might strong vision help create a meaningful legacy?",
  "In what way does inner fire encourage creativity throughout life?"
],
"FireModerate": [
  "How can balanced passion guide personal projects over time?",
  "In what way might steady confidence support raising children?",
  "How can calm enthusiasm improve creative expression?",
  "What happens when energy is used thoughtfully in later years?",
  "How might measured courage help in passing wisdom to others?",
  "In what way does steady optimism shape a person’s family life?",
  "How can gentle inspiration encourage creativity in daily living?",
  "What happens if excitement is balanced with patience in legacy building?",
  "How might thoughtful determination improve future outcomes?",
  "In what way does warm guidance support the next generation?"
],
"FireWeak": [
  "How can low confidence affect a person’s ability to inspire others?",
  "In what way might weak enthusiasm limit creative output?",
  "How can lack of energy reduce joy in later years?",
  "What happens when courage is missing in guiding younger people?",
  "How might fading passion affect a person’s legacy?",
  "In what way does hesitation weaken inner creative expression?",
  "How can weak determination prevent long-term projects from lasting?",
  "What happens if optimism is easily lost during later life?",
  "How might lack of vision reduce what is passed on to others?",
  "In what way does low inner fire make it harder to create or inspire?"
],
"EarthStrong": [
  "How can strong stability guide the way someone supports future generations?",
  "In what way might patience shape the legacy a person leaves behind?",
  "How can reliability improve the guidance offered to children or students?",
  "What happens when discipline continues into later life?",
  "How might steady determination strengthen a person’s creative projects?",
  "In what way does inner strength help maintain peace in older years?",
  "How can strong values shape what is passed on to others?",
  "What happens if persistence is applied to building a family legacy?",
  "How might loyalty improve relationships with younger generations?",
  "In what way does a solid foundation bring comfort in later life?"
],
"EarthModerate": [
  "How can balanced discipline support life in later years?",
  "In what way might steady habits guide children or family?",
  "How can calm patience improve creative expression over time?",
  "What happens when dependability shapes a person’s legacy?",
  "How might practical thinking improve relationships with younger people?",
  "In what way does fairness help build trust across generations?",
  "How can moderate self-control support peace in later life?",
  "What happens if consistency is applied gently over the years?",
  "How might measured loyalty improve a person’s influence on others?",
  "In what way does balance create steady contributions for the future?"
],
"EarthWeak": [
  "How can lack of stability affect later stages of life?",
  "In what way might weak discipline reduce long-term achievements?",
  "How can indecision change the way guidance is given to children?",
  "What happens when persistence is easily lost in important tasks?",
  "How might fragile focus affect creative projects in older years?",
  "In what way does inconsistency reduce trust within a family?",
  "How can weak patience make later life more stressful?",
  "What happens if reliability is missing when guiding others?",
  "How might poor discipline affect what is passed on as a legacy?",
  "In what way does lack of balance create uncertainty in the future?"
],
"MetalStrong": [
  "How can strong discipline guide the way someone influences younger people?",
  "In what way might firm willpower shape a person’s legacy?",
  "How can courage improve the protection and guidance offered to others?",
  "What happens when determination continues into later life?",
  "How might resilience strengthen creative projects or long-term goals?",
  "In what way does strong self-control bring peace during older years?",
  "How can firm values shape what is passed on across generations?",
  "What happens if persistence is applied to building a lasting legacy?",
  "How might loyalty improve trust within family or community?",
  "In what way does an unshakable foundation provide confidence for the future?"
],
"MetalModerate": [
  "How can balanced discipline support life in later years?",
  "In what way might steady willpower guide children or family?",
  "How can courage with balance improve long-term achievements?",
  "What happens when reliability shapes a person’s legacy?",
  "How might fairness improve influence on younger generations?",
  "In what way does measured self-control create peace over time?",
  "How can moderate resilience support creative growth in older years?",
  "What happens if persistence is applied gently but consistently?",
  "How might steady loyalty strengthen relationships across generations?",
  "In what way does balance create lasting yet flexible contributions?"
],
"MetalWeak": [
  "How can lack of discipline affect later stages of life?",
  "In what way might weak willpower reduce long-term achievements?",
  "How can indecision change the way guidance is given to younger people?",
  "What happens when determination is easily lost in important goals?",
  "How might fragile resilience affect creative or legacy projects?",
  "In what way does poor self-control reduce harmony in later years?",
  "How can weak courage make it harder to protect or guide others?",
  "What happens if persistence is missing when shaping a family’s future?",
  "How might unreliable loyalty weaken bonds with younger generations?",
  "In what way does lack of strength create uncertainty for the future?"
],
"WaterStrong": [
  "How can deep wisdom guide someone’s influence on future generations?",
  "In what way might strong adaptability help manage late-life changes?",
  "How can emotional insight improve the guidance given to younger people?",
  "What happens when creativity flows steadily through later years?",
  "How might imagination shape the legacy someone leaves behind?",
  "In what way does strong intuition support harmony in family and community?",
  "How can resilience in emotions help protect loved ones?",
  "What happens if knowledge is shared generously with younger minds?",
  "How might flexibility allow smoother transitions in later stages of life?",
  "In what way does clear understanding create trust across generations?"
],
"WaterModerate": [
  "How can balanced wisdom guide younger people without being overwhelming?",
  "In what way might steady adaptability ease changes in later years?",
  "How can moderate emotional insight support family harmony?",
  "What happens when imagination is used gently for legacy building?",
  "How might creativity with balance improve relationships across generations?",
  "In what way does fair intuition support decision-making in older years?",
  "How can resilience help manage stress in life’s later phases?",
  "What happens if knowledge is passed on in simple, steady ways?",
  "How might flexibility encourage smoother bonds with others?",
  "In what way does calm understanding bring peace to long-term goals?"
],
"WaterWeak": [
  "How can lack of wisdom affect guidance to younger generations?",
  "In what way might poor adaptability make late-life changes harder?",
  "How can weak emotional insight cause misunderstandings in family life?",
  "What happens when imagination fades too easily in older years?",
  "How might fragile creativity reduce one’s legacy?",
  "In what way does weak intuition create uncertainty in decision-making?",
  "How can low resilience affect peace in later stages of life?",
  "What happens if knowledge is not passed on effectively?",
  "How might rigid thinking prevent smoother family or community bonds?",
  "In what way does shallow understanding weaken influence on future generations?"
]
  },
  "month": {
"WoodStrong": [
  "How can strong determination shape a person’s career path?",
  "In what way does ambition influence long-term family stability?",
  "How might strong growth energy push someone toward leadership roles?",
  "What happens if someone’s drive to expand is left unchecked?",
  "How can powerful vision impact professional choices?",
  "In what way does persistence bring both rewards and struggles?",
  "How might a strong will affect teamwork in work environments?",
  "How can bold decisions change family dynamics?",
  "What happens when personal growth outpaces the support around it?",
  "In what way does strong initiative create opportunities in life?"
],
"WoodModerate": [
  "How can balanced ambition help in building a steady career?",
  "In what way does moderate growth energy support family harmony?",
  "How might steady vision guide professional choices?",
  "What happens if ambition is managed with patience?",
  "How can healthy determination support long-term goals?",
  "In what way does balanced willpower affect relationships at work?",
  "How might moderate persistence create gradual progress?",
  "How can steady planning ensure stability in family life?",
  "What happens when effort is applied at the right pace?",
  "In what way does balanced initiative open career opportunities?"
],
"WoodWeak": [
  "How can limited ambition affect career growth?",
  "In what way does weak determination impact family support?",
  "How might a lack of vision slow professional progress?",
  "What happens if growth energy is not nurtured?",
  "How can gentle persistence still lead to success over time?",
  "In what way does low willpower affect teamwork at work?",
  "How might weak initiative influence decision-making?",
  "How can outside guidance strengthen career direction?",
  "What happens when family or mentors provide needed structure?",
  "In what way does gradual effort help overcome inner hesitation?"
],
"FireStrong": [
  "How can strong passion drive someone’s career success?",
  "In what way does high energy shape family interactions?",
  "How might intense enthusiasm inspire leadership at work?",
  "What happens if strong ambition burns too quickly?",
  "How can strong drive create both progress and pressure?",
  "In what way does bright confidence attract recognition?",
  "How might strong motivation affect teamwork and harmony?",
  "How can powerful willpower change family direction?",
  "What happens when passion is not balanced with patience?",
  "In what way does intense energy open unexpected opportunities?"
],
"FireModerate": [
  "How can steady passion support long-term career growth?",
  "In what way does balanced warmth strengthen family bonds?",
  "How might healthy motivation guide professional choices?",
  "What happens if enthusiasm is expressed in measured ways?",
  "How can steady drive ensure career stability?",
  "In what way does moderate energy affect recognition at work?",
  "How might balanced ambition create harmony in relationships?",
  "How can consistent enthusiasm keep family connected?",
  "What happens when motivation is used at the right pace?",
  "In what way does stable energy open reliable opportunities?"
],
"FireWeak": [
  "How can low passion affect career direction?",
  "In what way does weak energy impact family support?",
  "How might lack of enthusiasm slow progress at work?",
  "What happens if recognition is not actively pursued?",
  "How can gentle warmth still create close family bonds?",
  "In what way does weak motivation influence career opportunities?",
  "How might limited energy affect teamwork and leadership?",
  "How can external encouragement strengthen drive?",
  "What happens when family or mentors provide needed spark?",
  "In what way does slow-building energy lead to steady progress?"
],
"EarthStrong": [
  "How can strong stability shape long-term career success?",
  "In what way does firm responsibility support family structure?",
  "How might a solid foundation help manage career challenges?",
  "What happens when someone is too rigid in their choices?",
  "How can strong patience lead to recognition in work life?",
  "In what way does being grounded improve decision-making?",
  "How might heavy responsibility create pressure at home?",
  "How can solid discipline ensure steady progress?",
  "What happens if stability blocks new opportunities?",
  "In what way does strong reliability inspire trust in others?"
],
"EarthModerate": [
  "How can balanced stability support both career and family?",
  "In what way does steady responsibility help teamwork?",
  "How might consistent discipline guide professional growth?",
  "What happens when patience is applied at the right time?",
  "How can balanced grounding keep work and home in harmony?",
  "In what way does steady effort attract recognition?",
  "How might moderate responsibility protect against setbacks?",
  "How can a stable mindset keep family connected?",
  "What happens when flexibility balances stability?",
  "In what way does reliable effort lead to long-term progress?"
],
"EarthWeak": [
  "How can weak stability affect career decisions?",
  "In what way does low grounding influence family support?",
  "How might lack of patience slow down professional growth?",
  "What happens if responsibility feels difficult to handle?",
  "How can small steps still create stability over time?",
  "In what way does weak discipline impact teamwork?",
  "How might uncertainty affect family bonds?",
  "How can outside guidance help build stronger foundations?",
  "What happens when flexibility replaces missing stability?",
  "In what way does growing patience open new opportunities?"
],
"MetalStrong": [
  "How can strong discipline shape long-term career success?",
  "In what way does ambition create recognition in work life?",
  "How might firmness in decisions strengthen leadership?",
  "What happens if strictness causes conflict with others?",
  "How can strong focus lead to steady achievements?",
  "In what way does courage help overcome professional obstacles?",
  "How might determination create pressure in family life?",
  "How can high standards push someone toward success?",
  "What happens when rigidity blocks new opportunities?",
  "In what way does a strong sense of justice inspire respect?"
],
"MetalModerate": [
  "How can balanced discipline support teamwork and growth?",
  "In what way does fair judgment improve workplace harmony?",
  "How might steady ambition guide career progress?",
  "What happens when firmness is balanced with flexibility?",
  "How can moderate courage encourage taking the right risks?",
  "In what way does balanced focus help overcome challenges?",
  "How might reasonable standards keep family harmony?",
  "How can clarity of mind support long-term planning?",
  "What happens when determination is applied with patience?",
  "In what way does balanced justice build trust among others?"
],
"MetalWeak": [
  "How can weak discipline affect career direction?",
  "In what way does low ambition slow professional progress?",
  "How might lack of focus weaken decision-making?",
  "What happens if fairness is hard to maintain?",
  "How can small steps restore inner courage?",
  "In what way does weak determination affect teamwork?",
  "How might uncertainty create challenges in family life?",
  "How can guidance from others strengthen ambition?",
  "What happens when flexibility replaces missing firmness?",
  "In what way does learning patience support steady progress?"
],
"WaterStrong": [
  "How can strong adaptability open doors in career growth?",
  "In what way does deep wisdom influence leadership choices?",
  "How might strong communication skills improve teamwork?",
  "What happens if flexibility leads to lack of focus?",
  "How can strong curiosity inspire innovative ideas?",
  "In what way does resourcefulness help overcome obstacles?",
  "How might quick adaptability affect family stability?",
  "How can strong intuition guide professional decisions?",
  "What happens when emotions flow too strongly in daily life?",
  "In what way does strong openness attract social connections?"
],
"WaterModerate": [
  "How can balanced adaptability support career stability?",
  "In what way does moderate wisdom guide steady progress?",
  "How might calm communication reduce misunderstandings?",
  "What happens when flexibility is paired with clear direction?",
  "How can practical curiosity support skill development?",
  "In what way does balanced resourcefulness ease challenges?",
  "How might steady intuition guide family harmony?",
  "How can moderate openness build lasting friendships?",
  "What happens when adaptability is used in the right measure?",
  "In what way does balanced flow of emotions improve well-being?"
],
"WaterWeak": [
  "How can weak adaptability slow career progress?",
  "In what way does lack of wisdom create confusion in choices?",
  "How might poor communication affect teamwork?",
  "What happens if rigidity blocks opportunities?",
  "How can small steps of curiosity rebuild knowledge?",
  "In what way does weak resourcefulness limit problem-solving?",
  "How might uncertainty create strain in family life?",
  "How can learning to listen strengthen relationships?",
  "What happens when emotions are held back too strongly?",
  "In what way does developing flexibility improve resilience?"
]
  },
  "year": {
"WoodStrong": [
  "How can strong family traditions guide a person’s public life?",
  "In what way does deep ancestral influence shape one’s reputation?",
  "How might strong roots support growth in social standing?",
  "What happens when a person carries forward strong cultural values?",
  "How can inherited wisdom strengthen community connections?",
  "In what way does loyalty to heritage influence opportunities?",
  "How might strong ties to early upbringing affect later recognition?",
  "What happens when family support is a foundation for reputation?",
  "How can strong legacy inspire leadership in society?",
  "In what way do firm traditions shape a person’s larger environment?"
],
"WoodModerate": [
  "How can balanced family traditions guide one’s social life?",
  "In what way does moderate ancestral influence affect reputation?",
  "How might steady roots support stable growth in the community?",
  "What happens when cultural values are respected without pressure?",
  "How can shared wisdom maintain harmony in social ties?",
  "In what way does moderate loyalty to heritage shape opportunities?",
  "How might a balanced upbringing affect social recognition?",
  "What happens when family influence is present but not controlling?",
  "How can respect for legacy create steady leadership?",
  "In what way do moderate traditions shape public life?"
],
"WoodWeak": [
  "How can weak family traditions affect public reputation?",
  "In what way does lack of strong ancestral guidance shape one’s path?",
  "How might fragile roots make social standing uncertain?",
  "What happens when cultural values are unclear or fading?",
  "How can limited inherited wisdom affect community ties?",
  "In what way does weak loyalty to heritage influence opportunities?",
  "How might a lack of early support impact later recognition?",
  "What happens when family legacy is difficult to carry forward?",
  "How can weak traditions challenge leadership roles?",
  "In what way does absence of strong roots affect one’s environment?"
],
"FireStrong": [
  "How can strong passion inspire lasting recognition in society?",
  "In what way does a powerful drive shape one’s reputation?",
  "How might strong vitality influence the legacy a person leaves?",
  "What happens when enthusiasm leads to wide influence?",
  "How can strong willpower ignite leadership in the community?",
  "In what way does radiant energy inspire trust and respect?",
  "How might a bold presence affect how history remembers someone?",
  "What happens when recognition grows from strong charisma?",
  "How can intense inspiration spark new opportunities for legacy?",
  "In what way does powerful ambition define a public image?"
],
"FireModerate": [
  "How can balanced passion guide steady recognition?",
  "In what way does moderate drive shape a reliable reputation?",
  "How might steady vitality influence one’s role in the community?",
  "What happens when enthusiasm is expressed with balance?",
  "How can a measured willpower support stable leadership?",
  "In what way does warm energy inspire respectful connections?",
  "How might a balanced presence affect long-term remembrance?",
  "What happens when recognition comes through steady charisma?",
  "How can healthy inspiration create sustainable opportunities?",
  "In what way does balanced ambition support a respected image?"
],
"FireWeak": [
  "How can weak passion affect a person’s reputation?",
  "In what way does low vitality influence legacy building?",
  "How might fragile drive make social influence uncertain?",
  "What happens when enthusiasm fades in public life?",
  "How can lack of willpower weaken leadership roles?",
  "In what way does dim energy affect community recognition?",
  "How might a faint presence shape long-term remembrance?",
  "What happens when recognition is difficult to achieve?",
  "How can limited inspiration reduce opportunities for influence?",
  "In what way does weak ambition affect one’s public image?"
],
"EarthStrong": [
  "How can strong stability influence the legacy one builds?",
  "In what way does solid grounding shape long-term reputation?",
  "How might strong roots strengthen ancestral connections?",
  "What happens when dependable nature earns public trust?",
  "How can firm values establish lasting traditions in society?",
  "In what way does resilience support a respected legacy?",
  "How might strong responsibility create generational influence?",
  "What happens when reliability leads to long-standing honor?",
  "How can firm foundations protect a person’s reputation?",
  "In what way does steadiness define the image left behind?"
],
"EarthModerate": [
  "How can balanced stability guide community recognition?",
  "In what way does steady grounding influence social trust?",
  "How might moderate roots support ancestral harmony?",
  "What happens when dependability is expressed in balance?",
  "How can measured values maintain family traditions?",
  "In what way does resilience with balance shape legacy?",
  "How might moderate responsibility support reputation?",
  "What happens when reliability is present but flexible?",
  "How can stable foundations encourage steady recognition?",
  "In what way does a calm presence influence remembrance?"
],
"EarthWeak": [
  "How can weak stability affect public reputation?",
  "In what way does fragile grounding shape legacy building?",
  "How might shallow roots weaken ancestral influence?",
  "What happens when dependability is uncertain?",
  "How can lack of firm values affect family traditions?",
  "In what way does fragile resilience weaken recognition?",
  "How might weak responsibility affect generational memory?",
  "What happens when reliability is hard to sustain?",
  "How can unstable foundations reduce social respect?",
  "In what way does inconsistency affect the image left behind?"
],
"MetalStrong": [
  "How can strong discipline shape the legacy a person leaves?",
  "In what way does firm determination influence public respect?",
  "How might sharp clarity guide the traditions one passes down?",
  "What happens when strong willpower earns recognition?",
  "How can unwavering principles protect long-term reputation?",
  "In what way does courage support generational influence?",
  "How might strong justice create honorable remembrance?",
  "What happens when resilience builds a lasting image?",
  "How can clear values strengthen ancestral respect?",
  "In what way does decisiveness define a person’s legacy?"
],
"MetalModerate": [
  "How can balanced discipline support steady recognition?",
  "In what way does measured determination shape legacy?",
  "How might moderate clarity guide ancestral connections?",
  "What happens when fair willpower is seen by others?",
  "How can steady principles maintain family traditions?",
  "In what way does courage in balance affect reputation?",
  "How might moderate justice support social trust?",
  "What happens when resilience is firm but flexible?",
  "How can clear values in moderation influence remembrance?",
  "In what way does calm decisiveness sustain legacy building?"
],
"MetalWeak": [
  "How can weak discipline affect long-term reputation?",
  "In what way does fragile determination shape public trust?",
  "How might lack of clarity weaken ancestral ties?",
  "What happens when willpower is uncertain?",
  "How can fading principles affect traditions over time?",
  "In what way does fragile courage reduce recognition?",
  "How might weak justice affect social respect?",
  "What happens when resilience is hard to maintain?",
  "How can unclear values harm the legacy one leaves?",
  "In what way does indecisiveness weaken generational influence?"
],
"WaterStrong": [
  "How can deep wisdom shape the legacy a person leaves behind?",
  "In what way does adaptability support long-term influence?",
  "How might strong intuition guide traditions and ancestry?",
  "What happens when flexible thinking earns recognition?",
  "How can flowing creativity inspire generational respect?",
  "In what way does resilience through change build legacy?",
  "How might curiosity enrich the knowledge passed down?",
  "What happens when insight creates lasting remembrance?",
  "How can broad vision strengthen ancestral honor?",
  "In what way does resourcefulness define the story of a family line?"
],
"WaterModerate": [
  "How can balanced wisdom support steady legacy building?",
  "In what way does moderate adaptability affect social respect?",
  "How might intuition in balance guide ancestral ties?",
  "What happens when fair flexibility influences recognition?",
  "How can steady creativity support family remembrance?",
  "In what way does calm resilience aid tradition keeping?",
  "How might balanced curiosity affect the wisdom passed down?",
  "What happens when insight is present but measured?",
  "How can a moderate vision sustain generational influence?",
  "In what way does fair resourcefulness protect long-term respect?"
],
"WaterWeak": [
  "How can weak wisdom affect the legacy one leaves?",
  "In what way does fragile adaptability reduce influence?",
  "How might lack of intuition weaken ancestral remembrance?",
  "What happens when flexibility is hard to show?",
  "How can fading creativity limit what is passed down?",
  "In what way does fragile resilience affect social respect?",
  "How might shallow curiosity harm generational learning?",
  "What happens when insight is unclear or forgotten?",
  "How can limited vision weaken ancestral honor?",
  "In what way does poor resourcefulness harm long-term legacy?"
]
  }
}