{
  "numerologyQuestions": {
    "LifePath": {
      "1": [
        "How can a strong sense of independence shape a person's daily life?",
        "In what way can leadership skills affect personal relationships?",
        "How might determination influence achieving long-term goals?",
        "In what way can confidence impact decision-making?",
        "How can taking initiative improve opportunities in life?",
        "In what way does self-reliance affect handling challenges?",
        "How might ambition influence career growth or success?",
        "How can personal drive affect overall happiness and satisfaction?",
        "In what way can being assertive shape interactions with others?",
        "How might a strong will help in overcoming obstacles?"
      ],
      "2": [
        "How can being cooperative improve a person's relationships?",
        "In what way does sensitivity help in understanding others?",
        "How might patience influence handling difficult situations?",
        "In what way can diplomacy affect teamwork or collaboration?",
        "How can empathy shape the way a person connects with others?",
        "In what way does compromise support resolving conflicts?",
        "How might listening carefully improve personal or work relationships?",
        "How can being supportive affect overall happiness in life?",
        "In what way does gentleness impact daily interactions?",
        "How might being considerate influence trust and respect from others?"
      ],
      "3": [
        "How can creativity influence a person's daily life?",
        "In what way does self-expression affect personal happiness?",
        "How might communication skills improve relationships?",
        "In what way can optimism shape decision-making?",
        "How can playfulness or humor impact social interactions?",
        "In what way does imagination support problem-solving?",
        "How might artistic talents influence career or opportunities?",
        "How can being expressive affect emotional well-being?",
        "In what way does storytelling or sharing ideas impact others?",
        "How might enthusiasm inspire and motivate people around them?"
      ],
      "4": [
        "How can discipline help a person achieve long-term goals?",
        "In what way does organization improve daily life?",
        "How might reliability affect relationships with others?",
        "In what way can hard work shape personal success?",
        "How can practicality influence decision-making?",
        "In what way does attention to detail support problem-solving?",
        "How might persistence help in overcoming challenges?",
        "How can being responsible affect trust from others?",
        "In what way does structure improve efficiency and stability?",
        "How might consistency contribute to overall well-being and growth?"
      ],
      "5": [
        "How can adaptability help a person handle change in life?",
        "In what way does curiosity influence learning and experiences?",
        "How might freedom of choice impact personal happiness?",
        "In what way can versatility improve problem-solving?",
        "How can exploring new ideas shape personal growth?",
        "In what way does flexibility support handling challenges?",
        "How might risk-taking influence opportunities and success?",
        "How can being open-minded affect relationships and connections?",
        "In what way does adventurousness impact daily experiences?",
        "How might embracing change inspire creativity and innovation?"
      ],
      "6": [
        "How can responsibility towards others shape personal relationships?",
        "In what way does caring for others affect daily life?",
        "How might nurturing skills influence happiness and well-being?",
        "In what way can providing support impact trust and connection?",
        "How can balancing personal needs with others’ needs improve life?",
        "In what way does compassion help in resolving conflicts?",
        "How might being reliable affect family or community relationships?",
        "How can protecting and guiding others contribute to a sense of purpose?",
        "In what way does empathy influence emotional connections?",
        "How might helping others inspire personal growth and satisfaction?"
      ],
      "7": [
        "How can introspection help a person understand themselves better?",
        "In what way does seeking knowledge influence personal growth?",
        "How might analyzing situations improve decision-making?",
        "In what way can solitude support emotional well-being?",
        "How can curiosity about life shape learning and experiences?",
        "In what way does reflection help in solving problems?",
        "How might critical thinking influence personal success?",
        "How can observing patterns improve understanding of others?",
        "In what way does studying deeply affect long-term growth?",
        "How might being thoughtful inspire wisdom and insight?"
      ],
      "8": [
        "How can ambition influence a person's achievements?",
        "In what way does financial responsibility shape daily life?",
        "How might leadership skills impact career success?",
        "In what way can determination help in reaching goals?",
        "How can strategic planning improve personal opportunities?",
        "In what way does confidence affect decision-making and risk-taking?",
        "How might discipline contribute to long-term success?",
        "How can managing resources wisely influence overall stability?",
        "In what way does assertiveness shape interactions with others?",
        "How might resilience help in overcoming setbacks and challenges?"
      ],
      "9": [
        "How can compassion influence a person's relationships?",
        "In what way does generosity impact daily life?",
        "How might understanding others improve personal connections?",
        "In what way can selflessness shape decision-making?",
        "How can helping others contribute to overall happiness?",
        "In what way does tolerance support resolving conflicts?",
        "How might a global perspective influence personal growth?",
        "How can sharing knowledge or experience affect others positively?",
        "In what way does caring for the community inspire purpose?",
        "How might embracing ideals and values shape life choices?"
      ],
      "11": [
        "How can intuition help a person make better decisions?",
        "In what way does inspiration influence creativity and actions?",
        "How might vision or foresight impact personal growth?",
        "In what way can sensitivity to others improve relationships?",
        "How can being idealistic shape daily choices and opportunities?",
        "In what way does spiritual awareness affect emotional well-being?",
        "How might imagination help in solving problems or challenges?",
        "How can guiding or uplifting others contribute to personal purpose?",
        "In what way does insight into situations improve understanding?",
        "How might being open to inspiration enhance life experiences?"
      ],
      "22": [
        "How can practical vision help a person achieve big goals?",
        "In what way does planning carefully influence success?",
        "How might leadership skills impact personal and professional growth?",
        "In what way can discipline help in accomplishing large tasks?",
        "How can using resources wisely shape life opportunities?",
        "In what way does strategic thinking improve decision-making?",
        "How might persistence influence achieving long-term objectives?",
        "How can balancing ambition with responsibility affect outcomes?",
        "In what way does organizing efforts contribute to stability and success?",
        "How might turning ideas into action impact overall life progress?"
      ],
      "33": [
        "How can caring deeply for others shape a person's daily life?",
        "In what way does teaching or guiding others influence personal growth?",
        "How might selflessness impact happiness and well-being?",
        "In what way can nurturing relationships improve emotional connections?",
        "How can using talents to help others create purpose in life?",
        "In what way does compassion support resolving conflicts?",
        "How might responsibility for others inspire positive actions?",
        "How can being a role model affect trust and respect from others?",
        "In what way does balancing personal needs with helping others improve life?",
        "How might dedicating efforts to meaningful causes enhance fulfillment?"
      ]
    },
    "Expression": {
      "1": [
        "How can taking initiative affect a person's achievements?",
        "In what way does confidence influence decision-making?",
        "How might leadership skills shape personal relationships?",
        "In what way can independence improve handling challenges?",
        "How can being proactive create new opportunities?",
        "In what way does self-reliance support personal growth?",
        "How might determination impact achieving long-term goals?",
        "How can assertiveness influence interactions with others?",
        "In what way does ambition shape career or life success?",
        "How might a strong will help overcome obstacles?"
      ],
      "2": [
        "How can teamwork improve achieving personal or shared goals?",
        "In what way does understanding others’ feelings affect interactions?",
        "How might being patient help in stressful situations?",
        "In what way can gentle communication strengthen relationships?",
        "How can offering support create trust and cooperation?",
        "In what way does valuing others’ opinions impact decisions?",
        "How might compromise lead to smoother collaborations?",
        "How can being attentive to others improve connection?",
        "In what way does kindness influence daily social interactions?",
        "How might building harmony affect overall happiness and well-being?"
      ],
      "3": [
        "How can expressing thoughts clearly improve personal connections?",
        "In what way does sharing ideas influence opportunities and growth?",
        "How might creative expression help a person feel more fulfilled?",
        "In what way can writing or speaking openly impact understanding?",
        "How can using humor or storytelling strengthen relationships?",
        "In what way does artistic activity support emotional well-being?",
        "How might exploring personal talents enhance confidence?",
        "How can expressing feelings positively affect daily life?",
        "In what way does imagination inspire solutions to problems?",
        "How might open communication encourage trust and collaboration?",
        "How might enthusiasm inspire and motivate people around them?"
      ],
      "4": [
        "How can organizing ideas help a person achieve goals effectively?",
        "In what way does planning tasks improve personal productivity?",
        "How might consistent effort express dedication and reliability?",
        "In what way can structuring daily routines support success?",
        "How can practical problem-solving reflect a person’s abilities?",
        "In what way does attention to detail enhance the quality of work?",
        "How might following a disciplined approach improve results?",
        "How can managing responsibilities show personal capability?",
        "In what way does creating order influence confidence and focus?",
        "How might persistent effort demonstrate self-expression through action?"
      ],
      "5": [
        "How can trying new experiences help a person express themselves?",
        "In what way does adapting to change reflect personal creativity?",
        "How might exploring different ideas enhance self-expression?",
        "In what way can being flexible improve learning and growth?",
        "How can embracing variety in life show personal freedom?",
        "In what way does curiosity encourage expressing unique talents?",
        "How might experimenting with new approaches impact success?",
        "How can adjusting to challenges reveal inner strengths?",
        "In what way does openness to change improve interactions with others?",
        "How might adventurous thinking support innovative problem-solving?"
      ],
      "6": [
        "How can taking care of others express a person's values?",
        "In what way does supporting friends and family show character?",
        "How might offering guidance reflect personal responsibility?",
        "In what way can nurturing relationships enhance emotional connections?",
        "How can balancing personal needs with helping others show wisdom?",
        "In what way does being dependable influence trust and respect?",
        "How might creating a supportive environment reflect personal care?",
        "How can protecting or guiding others express inner strength?",
        "In what way does empathy shape interactions and decisions?",
        "How might dedicating effort to meaningful causes show purpose?"
      ],
      "7": [
        "How can reflecting on experiences help a person understand themselves?",
        "In what way does analyzing situations express personal insight?",
        "How might studying or learning enhance self-expression?",
        "In what way can solitude support thinking and clarity?",
        "How can seeking knowledge reveal personal strengths?",
        "In what way does careful observation improve understanding of others?",
        "How might critical thinking help express thoughtful ideas?",
        "How can exploring concepts deeply enhance decision-making?",
        "In what way does questioning assumptions improve personal growth?",
        "How might reflecting on past choices guide future actions?"
      ],
      "8": [
        "How can setting ambitious goals express a person's drive?",
        "In what way does taking leadership roles reflect personal confidence?",
        "How might managing projects show self-expression through action?",
        "In what way can strategic thinking influence achieving success?",
        "How can making important decisions reflect inner strength?",
        "In what way does taking responsibility impact personal growth?",
        "How might organizing resources express capability and focus?",
        "How can persistence in goals demonstrate personal determination?",
        "In what way does assertive action shape interactions with others?",
        "How might overcoming obstacles showcase resilience and leadership?"
      ],
      "9": [
        "How can helping others express a person's values and care?",
        "In what way does sharing knowledge or resources influence impact?",
        "How might showing compassion reflect inner strength and understanding?",
        "In what way can supporting causes create personal purpose?",
        "How can practicing tolerance express empathy in daily life?",
        "In what way does being generous affect relationships with others?",
        "How might embracing ideals inspire personal and social growth?",
        "How can guiding or mentoring others reflect personal vision?",
        "In what way does focusing on community needs enhance fulfillment?",
        "How might advocating for fairness and kindness shape life choices?"
      ],
    "11": [
        "How can intuition guide a person in making thoughtful decisions?",
        "In what way does inspiration influence creative expression?",
        "How might insight help in understanding complex situations?",
        "In what way can being sensitive to others improve relationships?",
        "How can vision and ideals shape personal goals?",
        "In what way does inner awareness support emotional well-being?",
        "How might imagination lead to innovative problem-solving?",
        "How can uplifting others contribute to personal purpose?",
        "In what way does seeing possibilities improve life choices?",
        "How might openness to inspiration enhance experiences and growth?"
    ],
    "22": [
        "How can long-term planning express a person's vision and capability?",
        "In what way does strategic thinking support achieving big goals?",
        "How might leadership help turn ideas into practical outcomes?",
        "In what way can organizing resources create stability and success?",
        "How can balancing ambition with responsibility reflect maturity?",
        "In what way does building structures or systems express ability?",
        "How might persistence influence the achievement of significant projects?",
        "How can taking decisive action show practical wisdom?",
        "In what way does careful management improve outcomes for self and others?",
        "How might applying knowledge to real-world challenges impact life progress?"
    ],
    "33": [
        "How can nurturing and guiding others express a person’s purpose?",
        "In what way does selfless service influence personal fulfillment?",
        "How might teaching or mentoring create positive impact?",
        "In what way can compassion shape meaningful connections?",
        "How can using talents to help others reflect inner strength?",
        "In what way does dedicating efforts to worthwhile causes improve life?",
        "How might balancing care for self and others enhance well-being?",
        "How can being a role model inspire trust and respect?",
        "In what way does providing guidance strengthen community and relationships?",
        "How might leading through compassion and understanding create a sense of purpose?"
    ]
    },
"SoulUrge": {
    "1": [
        "How can the desire for independence shape a person's inner happiness?",
        "In what way does longing to lead reflect inner strength?",
        "How might the need to stand out influence self-esteem?",
        "In what way does wishing for freedom affect personal choices?",
        "How can the urge to achieve express a deep sense of purpose?",
        "In what way does valuing individuality influence inner peace?",
        "How might a strong drive for success affect emotional well-being?",
        "How can the longing to be first impact confidence?",
        "In what way does craving recognition shape inner motivation?",
        "How might striving for self-reliance fulfill inner needs?"
    ],
    "2": [
        "How can the need for harmony influence inner peace?",
        "In what way does desiring close bonds shape emotional well-being?",
        "How might valuing cooperation reflect inner happiness?",
        "In what way does wishing for partnership affect life choices?",
        "How can the urge for balance support inner calmness?",
        "In what way does longing for trust impact self-confidence?",
        "How might craving understanding influence inner fulfillment?",
        "How can the desire for unity affect relationships with others?",
        "In what way does valuing gentleness shape emotional needs?",
        "How might wishing for stability in love support inner growth?"
    ],
    "3": [
        "How can the urge to express emotions influence happiness?",
        "In what way does longing for creativity affect self-fulfillment?",
        "How might wishing to share joy shape daily life?",
        "In what way does desiring recognition for talents support confidence?",
        "How can the need to communicate reflect emotional needs?",
        "In what way does valuing playfulness affect inner motivation?",
        "How might the urge to create beauty shape personal satisfaction?",
        "How can longing for self-expression fulfill inner desires?",
        "In what way does wishing for joy influence personal choices?",
        "How might sharing laughter and ideas nurture the soul?"
    ],
    "4": [
        "How can the urge for security influence inner peace?",
        "In what way does longing for stability shape happiness?",
        "How might the need for order affect self-confidence?",
        "In what way does valuing discipline support inner calm?",
        "How can the desire for structure reflect emotional well-being?",
        "In what way does craving reliability shape inner satisfaction?",
        "How might the wish for a strong foundation influence life choices?",
        "How can the urge to work steadily fulfill inner needs?",
        "In what way does desiring routine affect inner balance?",
        "How might striving for dependability support emotional growth?"
    ],
    "5": [
        "How can the desire for freedom shape inner happiness?",
        "In what way does longing for change influence motivation?",
        "How might craving adventure reflect emotional needs?",
        "In what way does wishing for variety impact personal choices?",
        "How can the urge for exploration support inner fulfillment?",
        "In what way does valuing flexibility shape inner peace?",
        "How might desiring new experiences inspire growth?",
        "How can the longing for independence reflect emotional satisfaction?",
        "In what way does seeking excitement shape personal motivation?",
        "How might wishing for movement and progress affect inner balance?"
    ],
    "6": [
        "How can the desire to care for others fulfill inner needs?",
        "In what way does longing for family influence emotional peace?",
        "How might wishing to nurture shape happiness?",
        "In what way does valuing responsibility support inner balance?",
        "How can the urge to protect reflect emotional well-being?",
        "In what way does craving love and care impact self-confidence?",
        "How might wishing for harmony in relationships nurture the soul?",
        "How can the desire to help others reflect inner fulfillment?",
        "In what way does seeking loyalty affect inner happiness?",
        "How might devoting energy to loved ones shape emotional growth?"
    ],
    "7": [
        "How can the urge for solitude influence inner calm?",
        "In what way does longing for truth shape personal peace?",
        "How might wishing for deeper meaning affect emotional fulfillment?",
        "In what way does valuing inner reflection support happiness?",
        "How can the desire for wisdom reflect inner needs?",
        "In what way does craving spiritual connection shape the soul?",
        "How might wishing for privacy influence emotional strength?",
        "How can seeking knowledge nurture inner peace?",
        "In what way does longing for understanding affect personal choices?",
        "How might valuing self-discovery fulfill emotional growth?"
    ],
    "8": [
        "How can the desire for success shape inner satisfaction?",
        "In what way does longing for power influence emotional needs?",
        "How might craving recognition reflect personal fulfillment?",
        "In what way does wishing for achievement support inner motivation?",
        "How can the urge for authority impact self-confidence?",
        "In what way does valuing accomplishment nurture happiness?",
        "How might the desire for control reflect emotional strength?",
        "How can striving for results fulfill inner goals?",
        "In what way does wishing for financial security shape inner peace?",
        "How might the drive for influence reflect deeper needs?"
    ],
    "9": [
        "How can the urge to serve others influence inner peace?",
        "In what way does longing for compassion reflect happiness?",
        "How might wishing to help the world shape emotional growth?",
        "In what way does valuing kindness nurture the soul?",
        "How can the desire for selflessness support inner purpose?",
        "In what way does craving forgiveness affect personal choices?",
        "How might longing for unity reflect emotional fulfillment?",
        "How can the need to give back shape inner satisfaction?",
        "In what way does wishing for justice nurture happiness?",
        "How might dedicating oneself to others fulfill emotional needs?"
    ],
    "11": [
        "How can the longing for inspiration shape inner purpose?",
        "In what way does craving spiritual awareness nurture happiness?",
        "How might wishing for higher meaning influence emotional balance?",
        "In what way does valuing intuition reflect inner peace?",
        "How can the desire to uplift others fulfill the soul?",
        "In what way does seeking vision shape personal motivation?",
        "How might longing for enlightenment affect emotional fulfillment?",
        "How can the urge to connect with higher truths support inner growth?",
        "In what way does valuing sensitivity shape self-expression?",
        "How might being guided by inner light nurture happiness?"
    ],
    "22": [
        "How can the desire to build something lasting reflect inner purpose?",
        "In what way does longing for achievement shape personal motivation?",
        "How might craving responsibility affect emotional fulfillment?",
        "In what way does wishing for structure nurture inner peace?",
        "How can the urge to leave a legacy shape inner happiness?",
        "In what way does valuing practicality reflect emotional needs?",
        "How might striving for great goals fulfill the soul?",
        "How can balancing vision with responsibility support inner growth?",
        "In what way does seeking accomplishment shape deeper satisfaction?",
        "How might the need to contribute something meaningful affect emotional well-being?"
    ],
    "33": [
        "How can the longing to serve others nurture inner peace?",
        "In what way does craving unconditional love shape happiness?",
        "How might wishing to guide others reflect inner fulfillment?",
        "In what way does valuing compassion support the soul’s purpose?",
        "How can the desire to heal or comfort reflect emotional needs?",
        "In what way does longing for harmony influence inner strength?",
        "How might dedicating life to helping others fulfill emotional growth?",
        "How can being a source of guidance nurture inner happiness?",
        "In what way does valuing forgiveness and kindness shape purpose?",
        "How might living with compassion express the deepest inner desires?"
    ]
},
"Personality": {
    "1": [
        "How might others view someone who naturally takes the lead?",
        "In what way can appearing confident influence first impressions?",
        "How might being seen as independent affect relationships?",
        "How can showing ambition shape how others respond?",
        "In what way does appearing determined influence opportunities?",
        "How might being recognized as a leader affect social standing?",
        "How can projecting strength impact personal image?",
        "In what way does being seen as self-reliant shape trust?",
        "How might appearing bold influence how others approach?",
        "How can being viewed as decisive affect interactions?"
    ],
    "2": [
        "How might others view someone who appears gentle and cooperative?",
        "In what way can being seen as supportive influence friendships?",
        "How might appearing peaceful affect first impressions?",
        "How can showing kindness shape how others respond?",
        "In what way does being viewed as understanding affect trust?",
        "How might being seen as diplomatic influence relationships?",
        "How can appearing balanced impact how others approach?",
        "In what way does being perceived as patient affect opportunities?",
        "How might showing sensitivity shape social image?",
        "How can being seen as a good listener influence respect?"
    ],
    "3": [
        "How might others view someone who appears lively and expressive?",
        "In what way does being seen as joyful shape first impressions?",
        "How might appearing playful affect social interactions?",
        "How can showing creativity influence how others respond?",
        "In what way does being viewed as charming affect opportunities?",
        "How might being seen as talkative shape friendships?",
        "How can projecting enthusiasm impact how others approach?",
        "In what way does appearing imaginative influence reputation?",
        "How might being recognized as entertaining shape social standing?",
        "How can showing optimism affect how others perceive value?"
    ],
    "4": [
        "How might others view someone who appears reliable and steady?",
        "In what way can being seen as practical shape first impressions?",
        "How might showing discipline affect how others respond?",
        "How can being perceived as hardworking influence respect?",
        "In what way does appearing dependable shape trust?",
        "How might being viewed as serious affect relationships?",
        "How can showing orderliness impact opportunities?",
        "In what way does being recognized as stable influence reputation?",
        "How might projecting responsibility shape social image?",
        "How can appearing structured affect long-term impressions?"
    ],
    "5": [
        "How might others view someone who appears adventurous and free?",
        "In what way does being seen as adaptable shape first impressions?",
        "How might showing curiosity affect social interactions?",
        "How can appearing spontaneous influence how others respond?",
        "In what way does being recognized as lively shape friendships?",
        "How might projecting freedom-loving traits affect relationships?",
        "How can showing flexibility impact how others approach?",
        "In what way does appearing restless influence reputation?",
        "How might being viewed as exciting shape opportunities?",
        "How can showing openness to change affect respect?"
    ],
    "6": [
        "How might others view someone who appears caring and protective?",
        "In what way does being seen as responsible shape first impressions?",
        "How might showing nurturing traits affect friendships?",
        "How can appearing devoted influence how others respond?",
        "In what way does being recognized as family-oriented affect respect?",
        "How might being viewed as loyal shape trust?",
        "How can projecting compassion impact social image?",
        "In what way does appearing service-minded influence opportunities?",
        "How might being recognized as supportive shape relationships?",
        "How can showing love for harmony affect first impressions?"
    ],
    "7": [
        "How might others view someone who appears thoughtful and reserved?",
        "In what way does being seen as wise shape first impressions?",
        "How might showing a reflective nature affect relationships?",
        "How can appearing mysterious influence how others respond?",
        "In what way does being viewed as analytical affect reputation?",
        "How might being recognized as spiritual shape social image?",
        "How can showing curiosity about deeper truths impact respect?",
        "In what way does appearing private influence friendships?",
        "How might projecting intelligence shape opportunities?",
        "How can being seen as deep-thinking affect first impressions?"
    ],
    "8": [
        "How might others view someone who appears powerful and ambitious?",
        "In what way does being seen as authoritative shape first impressions?",
        "How might projecting confidence in success affect respect?",
        "How can showing determination influence relationships?",
        "In what way does appearing influential shape opportunities?",
        "How might being viewed as strong-willed affect social image?",
        "How can being recognized as a go-getter impact reputation?",
        "In what way does showing control affect trust from others?",
        "How might being seen as achievement-focused shape friendships?",
        "How can projecting authority influence long-term impressions?"
    ],
    "9": [
        "How might others view someone who appears compassionate and giving?",
        "In what way does being seen as selfless shape first impressions?",
        "How might showing kindness affect relationships?",
        "How can appearing humanitarian influence respect?",
        "In what way does being viewed as understanding shape opportunities?",
        "How might being recognized as generous affect reputation?",
        "How can projecting empathy impact social interactions?",
        "In what way does appearing forgiving shape friendships?",
        "How might being seen as idealistic affect trust?",
        "How can showing concern for others influence long-term impressions?"
    ],
    "11": [
        "How might others view someone who appears inspiring and visionary?",
        "In what way does being seen as intuitive shape first impressions?",
        "How might showing sensitivity affect relationships?",
        "How can projecting higher awareness influence respect?",
        "In what way does being viewed as spiritual shape opportunities?",
        "How might being recognized as uplifting affect reputation?",
        "How can appearing enlightened impact social interactions?",
        "In what way does showing charisma shape friendships?",
        "How might being seen as deeply aware influence trust?",
        "How can projecting idealism affect how others respond?"
    ],
    "22": [
        "How might others view someone who appears practical yet visionary?",
        "In what way does being seen as dependable shape first impressions?",
        "How might showing leadership in building affect reputation?",
        "How can appearing determined influence respect?",
        "In what way does being viewed as powerful shape opportunities?",
        "How might being recognized as organized affect social image?",
        "How can projecting balance between dream and reality shape trust?",
        "In what way does showing long-term focus impact friendships?",
        "How might being seen as a builder influence how others respond?",
        "How can appearing purposeful affect first impressions?"
    ],
    "33": [
        "How might others view someone who appears compassionate and wise?",
        "In what way does being seen as a guide shape first impressions?",
        "How might showing devotion to others affect relationships?",
        "How can projecting unconditional love influence respect?",
        "In what way does being viewed as nurturing shape opportunities?",
        "How might being recognized as spiritually mature affect reputation?",
        "How can appearing harmonious impact social interactions?",
        "In what way does showing healing energy shape trust?",
        "How might being seen as uplifting affect friendships?",
        "How can projecting selfless service influence long-term impressions?"
    ]
},
 "BirthdayNumber": {
  "1": [
    "How can being independent shape a person’s daily life?",
    "In what way does ambition influence personal success?",
    "How might determination affect the ability to reach goals?",
    "In what way can leadership skills guide relationships?",
    "How can original thinking impact career or creativity?",
    "In what way does confidence improve self-growth?",
    "How might strong willpower help overcome challenges?",
    "In what way can taking initiative shape opportunities?",
    "How can focusing on goals create long-term success?",
    "In what way might learning to balance independence improve life?"
  ],
  "2": [
    "How can cooperation make life smoother for a person?",
    "In what way does empathy influence close relationships?",
    "How might sensitivity help in resolving conflicts?",
    "In what way can intuition guide important choices?",
    "How can being supportive strengthen bonds with others?",
    "In what way does patience improve social harmony?",
    "How might diplomacy help in difficult situations?",
    "In what way can valuing peace shape personal growth?",
    "How can teamwork bring greater success?",
    "In what way does balancing independence and closeness improve well-being?"
  ],
  "3": [
    "How can creativity bring joy to daily life?",
    "In what way does optimism influence personal success?",
    "How might being expressive strengthen relationships?",
    "In what way can charm open up opportunities?",
    "How can communication skills help solve problems?",
    "In what way does playfulness create stronger bonds?",
    "How might artistic talent shape personal growth?",
    "In what way can humor improve challenging situations?",
    "How can spreading positivity impact others’ lives?",
    "In what way does balancing energy improve focus and success?"
  ],
  "4": [
    "How can discipline build a stronger foundation for life?",
    "In what way does hard work influence success?",
    "How might reliability strengthen trust in relationships?",
    "In what way can structure bring stability?",
    "How can being practical improve decision-making?",
    "In what way does patience create steady progress?",
    "How might responsibility help achieve big goals?",
    "In what way can being organized make life easier?",
    "How can stability bring comfort to loved ones?",
    "In what way does avoiding rigidity improve flexibility in life?"
  ],
  "5": [
    "How can adventure add excitement to life?",
    "In what way does adaptability help in change?",
    "How might curiosity open new opportunities?",
    "In what way can freedom-seeking influence happiness?",
    "How can variety make daily routines more enjoyable?",
    "In what way does quick thinking solve challenges?",
    "How might travel inspire new growth?",
    "In what way can embracing change improve self-confidence?",
    "How can flexibility create stronger relationships?",
    "In what way does balancing freedom with responsibility improve life?"
  ],
  "6": [
    "How can caring for others bring personal joy?",
    "In what way does responsibility strengthen family life?",
    "How might protection and guidance create harmony?",
    "In what way can kindness improve relationships?",
    "How can a sense of duty shape personal growth?",
    "In what way does nurturing create trust and love?",
    "How might being supportive bring peace to others?",
    "In what way can serving the community create fulfillment?",
    "How can harmony improve emotional well-being?",
    "In what way does balancing care for self and others prevent stress?"
  ],
  "7": [
    "How can deep thinking shape a person’s wisdom?",
    "In what way does curiosity influence learning?",
    "How might reflection improve decision-making?",
    "In what way can solitude bring peace of mind?",
    "How can seeking truth inspire personal growth?",
    "In what way does study expand opportunities?",
    "How might questioning beliefs create new insights?",
    "In what way can inner awareness guide life choices?",
    "How can intuition strengthen personal trust?",
    "In what way does balancing solitude and connection improve well-being?"
  ],
  "8": [
    "How can ambition help create material success?",
    "In what way does leadership influence progress?",
    "How might authority guide big responsibilities?",
    "In what way can discipline shape achievements?",
    "How can managing resources improve life security?",
    "In what way does persistence build strong results?",
    "How might goal-setting create opportunities?",
    "In what way can power be used to inspire others?",
    "How can balancing ambition with compassion improve relationships?",
    "In what way does responsibility for success shape personal growth?"
  ],
  "9": [
    "How can compassion influence personal choices?",
    "In what way does generosity create deeper bonds?",
    "How might helping others bring meaning to life?",
    "In what way can creativity express care for humanity?",
    "How can selflessness inspire personal growth?",
    "In what way does empathy strengthen community?",
    "How might forgiveness improve relationships?",
    "In what way can caring about society create purpose?",
    "How can focusing on fairness bring peace of mind?",
    "In what way does balancing giving with self-care improve well-being?"
  ],
  "11": [
    "How can intuition inspire life direction?",
    "In what way does sensitivity shape close connections?",
    "How might vision create opportunities for growth?",
    "In what way can inspiration guide creative choices?",
    "How can being empathetic improve relationships?",
    "In what way does inner awareness bring balance?",
    "How might imagination influence daily life?",
    "In what way can uplifting others create fulfillment?",
    "How can balancing emotions improve confidence?",
    "In what way does trusting instincts bring success?"
  ],
  "22": [
    "How can big dreams guide a person’s purpose?",
    "In what way does discipline create strong achievements?",
    "How might turning ideas into action build confidence?",
    "In what way can organization shape long-term success?",
    "How can persistence lead to lasting impact?",
    "In what way does balancing vision with practicality improve outcomes?",
    "How might leadership support community growth?",
    "In what way can building something lasting create pride?",
    "How can using skills to help others bring fulfillment?",
    "In what way does avoiding perfectionism improve progress?"
  ],
  "33": [
    "How can compassion guide a person’s purpose?",
    "In what way does teaching others create meaning?",
    "How might nurturing strengthen communities?",
    "In what way can service bring personal fulfillment?",
    "How can empathy shape supportive relationships?",
    "In what way does inspiring others bring joy?",
    "How might being a role model create lasting impact?",
    "In what way can balancing care for self and others improve health?",
    "How can sharing wisdom strengthen trust?",
    "In what way does leading through love improve daily life?"
  ]
},
 "MaturityQuestions": {
  "1": [
    "How can developing independence shape a person’s later life?",
    "In what way does confidence improve long-term success?",
    "How might originality help someone stand out as they mature?",
    "How can courage in later years inspire others?",
    "In what way does leadership ability impact personal growth?",
    "How can relying on personal strength affect future stability?",
    "How might pioneering ideas create opportunities later in life?",
    "In what way does learning humility support mature leadership?",
    "How can resilience influence life direction over time?",
    "How might self-reliance improve overall fulfillment?"
  ],
  "2": [
    "How can becoming more cooperative improve later relationships?",
    "In what way does diplomacy help with maturity?",
    "How might patience shape a person’s future path?",
    "How can emotional balance create harmony in later years?",
    "In what way does intuition support long-term choices?",
    "How might learning to be supportive strengthen connections?",
    "How can becoming a peacemaker affect personal growth?",
    "How might maturity reduce dependency on others?",
    "How can sensitivity be used positively later in life?",
    "In what way does harmony lead to a more peaceful future?"
  ],
  "3": [
    "How can creativity blossom more fully in later years?",
    "In what way does joy influence maturity?",
    "How might self-expression inspire others later in life?",
    "How can positivity bring fulfillment over time?",
    "In what way do communication skills help during maturity?",
    "How might arts or performance bring satisfaction later?",
    "How can playful energy improve the aging process?",
    "In what way does scattered energy limit mature growth?",
    "How can inspiring others bring joy in later years?",
    "How might lightheartedness improve long-term well-being?"
  ],
  "4": [
    "How can discipline become more valuable with maturity?",
    "In what way does stability shape future success?",
    "How might patience lead to stronger foundations later in life?",
    "How can reliability influence reputation over time?",
    "In what way does structure bring peace during maturity?",
    "How might order create security in later years?",
    "How can persistence lead to long-lasting achievements?",
    "In what way does flexibility help avoid rigidity with age?",
    "How can being grounded improve future stability?",
    "How might practicality ensure steady progress later in life?"
  ],
  "5": [
    "How can flexibility create freedom in later years?",
    "In what way does adaptability support maturity?",
    "How might risk-taking shape future opportunities?",
    "How can exploration bring meaning later in life?",
    "In what way does travel open perspectives as a person matures?",
    "How might curiosity lead to continued growth over time?",
    "How can versatility create opportunities in later years?",
    "In what way does change prevent stagnation as one matures?",
    "How can restlessness be managed for positive outcomes?",
    "How might freedom-seeking bring long-term satisfaction?"
  ],
  "6": [
    "How can responsibility deepen with maturity?",
    "In what way does caregiving bring fulfillment in later years?",
    "How might nurturing roles strengthen family bonds?",
    "How can service to others improve personal growth?",
    "In what way does harmony create peace during maturity?",
    "How might unconditional love transform later life?",
    "How can being a pillar for others bring purpose?",
    "In what way does balancing care with self-needs matter?",
    "How can counseling or teaching roles bring satisfaction?",
    "How might protecting others define later achievements?"
  ],
  "7": [
    "How can seeking wisdom shape later years?",
    "In what way does spirituality influence maturity?",
    "How might reflection bring clarity over time?",
    "How can solitude help personal growth later in life?",
    "In what way does analysis bring deeper understanding?",
    "How might curiosity lead to lifelong learning?",
    "How can philosophy support peace in later years?",
    "In what way does avoiding isolation improve maturity?",
    "How can intuition become stronger with age?",
    "How might wisdom inspire others during maturity?"
  ],
  "8": [
    "How can ambition drive achievements in later life?",
    "In what way does authority impact maturity?",
    "How might business skills create lasting success?",
    "How can discipline support financial security?",
    "In what way does leadership shape future outcomes?",
    "How might power be managed responsibly over time?",
    "How can leaving a legacy bring fulfillment?",
    "In what way does recognition affect personal growth?",
    "How might balance between power and humility improve maturity?",
    "How can achievements define life purpose later on?"
  ],
  "9": [
    "How can compassion guide maturity?",
    "In what way does generosity influence later years?",
    "How might forgiveness bring peace in maturity?",
    "How can idealism shape future direction?",
    "In what way does empathy improve relationships over time?",
    "How might creativity serve humanity in later life?",
    "How can tolerance create harmony during maturity?",
    "In what way does service bring fulfillment in later years?",
    "How might wisdom inspire society as one matures?",
    "How can universal love guide life purpose?"
  ],
  "11": [
    "How can intuition become stronger in later years?",
    "In what way does spiritual awakening guide maturity?",
    "How might vision inspire others during later life?",
    "How can creativity bring fulfillment in maturity?",
    "In what way does sensitivity help guide others?",
    "How might healing roles provide meaning later in life?",
    "How can emotional balance support maturity?",
    "In what way does inspiration affect a person’s legacy?",
    "How might nervous energy be turned into productivity?",
    "How can higher purpose shape one’s later years?"
  ],
  "22": [
    "How can big visions become reality in later years?",
    "In what way does leadership improve maturity?",
    "How might organization create long-term impact?",
    "How can balancing dreams with practicality bring success?",
    "In what way does building lasting contributions matter?",
    "How might stress be managed for better maturity?",
    "How can leaving a strong foundation inspire others?",
    "In what way does combining insight with action help growth?",
    "How might discipline turn visions into achievements?",
    "How can maturity lead to a legacy of creation?"
  ],
  "33": [
    "How can compassion guide maturity into service?",
    "In what way does teaching bring fulfillment later in life?",
    "How might healing roles shape one’s legacy?",
    "How can empathy improve later relationships?",
    "In what way does creativity blend with responsibility over time?",
    "How might balance between giving and self-care matter?",
    "How can inspiration uplift others during maturity?",
    "In what way does unconditional love guide purpose?",
    "How might harmony create peace in later years?",
    "How can maturity lead to becoming a source of wisdom?"
  ]
},
"HiddenPassion": {
  "1": [
    "How does your hidden drive for independence show up in your life?",
    "In what ways does ambition motivate your daily actions?",
    "How do you feel when you take the lead in situations?",
    "What gives you the courage to stand out from others?",
    "How does self-reliance make you feel fulfilled?",
    "In what ways does determination shape your path?",
    "How do you balance independence with cooperation?",
    "What role does originality play in your choices?",
    "How do you channel your willpower into achievements?",
    "In what ways does leadership bring out your true self?"
  ],
  "2": [
    "How does your hidden need for harmony influence your relationships?",
    "In what ways does sensitivity guide your decisions?",
    "How do you feel when you bring peace to a situation?",
    "What role does partnership play in your life?",
    "How do you handle disagreements while seeking balance?",
    "In what ways does intuition guide your choices?",
    "How does cooperation help you express yourself?",
    "What brings you the most joy in companionship?",
    "How do you balance your emotions when supporting others?",
    "In what ways do you nurture connections around you?"
  ],
  "3": [
    "How does your hidden urge for expression show in daily life?",
    "In what ways do you share your creativity with others?",
    "How does joy fuel your personal growth?",
    "What role does communication play in your fulfillment?",
    "In what ways does humor help you inspire others?",
    "How do you express yourself in social situations?",
    "How does creativity bring you a sense of purpose?",
    "What makes you feel most alive when you create?",
    "How do you balance playfulness with responsibility?",
    "In what ways does your imagination shape your journey?"
  ],
  "4": [
    "How does your hidden need for stability guide your actions?",
    "In what ways does discipline give you strength?",
    "How do you feel when life is structured and organized?",
    "What role does patience play in your success?",
    "How do you build a strong foundation for your goals?",
    "In what ways does responsibility bring you peace?",
    "How do you balance structure with flexibility?",
    "What makes you feel secure and steady?",
    "How does reliability influence your self-image?",
    "In what ways do you create lasting results through effort?"
  ],
  "5": [
    "How does your hidden passion for freedom show itself?",
    "In what ways do you embrace change in your life?",
    "How do you feel when you are free to explore?",
    "What role does curiosity play in your growth?",
    "In what ways does adventure inspire you?",
    "How do you adapt to unexpected situations?",
    "What excites you most about trying new things?",
    "How does versatility make you stronger?",
    "In what ways does courage shape your journey?",
    "How do you balance freedom with responsibility?"
  ],
  "6": [
    "How does your hidden love for responsibility shape you?",
    "In what ways do you feel fulfilled by helping others?",
    "How do you express care in your daily life?",
    "What role does family play in your sense of purpose?",
    "How do you balance giving with your own needs?",
    "In what ways does harmony bring you peace?",
    "How do you find joy in nurturing others?",
    "What makes you feel appreciated when you serve?",
    "How does your sense of fairness guide your actions?",
    "In what ways do you bring beauty and balance to life?"
  ],
  "7": [
    "How does your hidden quest for knowledge show itself?",
    "In what ways does spirituality guide you?",
    "How do you feel when you spend time in reflection?",
    "What role does curiosity play in your search for truth?",
    "How does solitude give you strength?",
    "In what ways does analysis shape your understanding?",
    "How do you balance logic with intuition?",
    "What makes you feel most connected to wisdom?",
    "How do you channel your inner seeker in daily life?",
    "In what ways does learning bring you fulfillment?"
  ],
  "8": [
    "How does your hidden desire for success guide your path?",
    "In what ways does ambition bring out your best self?",
    "How do you feel when you achieve recognition?",
    "What role does discipline play in your success?",
    "How do you express your natural leadership?",
    "In what ways does financial stability empower you?",
    "How do you balance authority with compassion?",
    "What makes you determined to keep striving?",
    "How do you use power responsibly in your life?",
    "In what ways do your achievements leave a legacy?"
  ],
  "9": [
    "How does your hidden compassion influence your choices?",
    "In what ways do you express humanitarian values?",
    "How do you feel when you are helping others?",
    "What role does forgiveness play in your growth?",
    "How does creativity connect you to humanity?",
    "In what ways does empathy guide your relationships?",
    "How do you balance personal needs with serving others?",
    "What inspires you to work for a greater cause?",
    "How do you find strength in universal love?",
    "In what ways does your vision uplift those around you?"
  ]
},
"KarmicLessons": {
  "1": [
    "How do you handle situations where you must stand alone?",
    "In what ways do you rely too much on others for direction?",
    "What does independence mean to you in your personal life?",
    "How do you build confidence in making your own decisions?",
    "When have you hesitated to take initiative, and why?",
    "What helps you overcome fear of being on your own?",
    "How do you balance self-reliance with healthy cooperation?",
    "What role does courage play in shaping your path?",
    "How do you practice decisiveness in small daily choices?",
    "In what ways are you learning to express individuality?"
  ],
  "2": [
    "How do you respond when asked to compromise in relationships?",
    "In what ways do you struggle with patience or tact?",
    "How does cooperation challenge you in group settings?",
    "What role does emotional sensitivity play in your choices?",
    "How do you handle disagreements without losing balance?",
    "When do you find it difficult to work as part of a team?",
    "What helps you develop greater harmony with others?",
    "How do you nurture your ability to listen and empathize?",
    "What lessons do you learn from failed partnerships?",
    "How do you practice diplomacy in your interactions?"
  ],
  "3": [
    "How do you feel when you hold back from expressing yourself?",
    "In what ways do you struggle to share your ideas openly?",
    "How does communication affect your sense of self-worth?",
    "When do you find it hardest to express joy or optimism?",
    "What role does creativity play in your healing process?",
    "How do you deal with self-doubt around your talents?",
    "What helps you bring more playfulness into daily life?",
    "How do you overcome fear of speaking up?",
    "What inspires you to live with greater enthusiasm?",
    "How do you develop confidence in your self-expression?"
  ],
  "4": [
    "How do you react when faced with structured responsibilities?",
    "In what ways do you avoid persistence or hard work?",
    "What role does order play in your personal growth?",
    "How do you create stability in your daily life?",
    "When have you struggled with maintaining discipline?",
    "How do you build patience in long-term goals?",
    "What helps you stay reliable when others depend on you?",
    "How do you handle tasks that require consistency?",
    "What makes you resist structure, and how can you shift it?",
    "How do you learn to value practical effort in your journey?"
  ],
  "5": [
    "How do you react to unexpected change in your life?",
    "In what ways do you resist flexibility or adaptability?",
    "What role does freedom play in your decision-making?",
    "How do you manage extremes in seeking adventure or pleasure?",
    "When do you feel trapped, and how do you handle it?",
    "How do you balance your desire for freedom with responsibility?",
    "What helps you embrace moderation instead of excess?",
    "How do you face your fears about change?",
    "What lessons do you learn when taking risks?",
    "How do you use adaptability to grow as a person?"
  ],
  "6": [
    "How do you handle responsibilities in your personal life?",
    "In what ways do you avoid obligations or commitments?",
    "How do you balance giving to others with caring for yourself?",
    "What role does compassion play in your decisions?",
    "How do you respond when family or loved ones depend on you?",
    "When do you feel overwhelmed by responsibility?",
    "How do you cultivate fairness in relationships?",
    "What helps you develop more patience when serving others?",
    "How do you nurture others without losing balance?",
    "What role does responsible love play in your growth?"
  ],
  "7": [
    "How do you respond when logic alone fails you?",
    "In what ways do you struggle with trusting intuition?",
    "What role does reflection play in your self-growth?",
    "How do you handle doubts about deeper truths in life?",
    "When do you resist looking inward for answers?",
    "How do you cultivate trust in spiritual awareness?",
    "What helps you connect inner wisdom with daily choices?",
    "How do you balance intellectual analysis with faith?",
    "What role does solitude play in your self-understanding?",
    "How do you practice patience in your search for wisdom?"
  ],
  "8": [
    "How do you handle situations involving power or control?",
    "In what ways do you fear success or recognition?",
    "What role does money play in shaping your choices?",
    "How do you react when faced with ambition or authority?",
    "When do you misuse your influence, and why?",
    "How do you cultivate discipline in financial matters?",
    "What helps you balance material goals with integrity?",
    "How do you learn from failures related to success?",
    "What role does ambition play in your spiritual growth?",
    "How do you use strength responsibly in daily life?"
  ],
  "9": [
    "How do you respond when asked to forgive and let go?",
    "In what ways do you struggle with empathy or compassion?",
    "What role does service to others play in your fulfillment?",
    "How do you handle feelings of intolerance or judgment?",
    "When do you resist putting others before yourself?",
    "How do you express love for humanity in daily actions?",
    "What helps you embrace a broader vision of life?",
    "How do you overcome attachment to personal desires?",
    "What role does creativity play in your compassion?",
    "How do you practice universal love in practical ways?"
  ]
},
"BalanceNumber": {
  "1": [
    "How do you assert yourself when faced with a challenge?",
    "In what ways do you stand firm without becoming domineering?",
    "How do you decide quickly under pressure?",
    "What helps you avoid arrogance while being confident?",
    "When do you find it difficult to rely on your own judgment?",
    "How do you balance independence with cooperation?",
    "What role does courage play in your conflict resolution?",
    "How do you handle moments when others doubt your decisions?",
    "In what ways do you practice healthy self-assertion?",
    "How do you stay decisive without rushing?"
  ],
  "2": [
    "How do you create harmony when tensions rise?",
    "In what ways do you use tact to resolve conflicts?",
    "How do you balance patience with action in problem-solving?",
    "What helps you avoid passive-aggressive responses?",
    "How do you find middle ground when views clash?",
    "When do you struggle with indecision, and why?",
    "How do you use cooperation to strengthen relationships?",
    "What role does empathy play in your approach to conflict?",
    "How do you respond when someone refuses compromise?",
    "In what ways do you nurture peace in daily challenges?"
  ],
  "3": [
    "How do you use communication to ease tension?",
    "In what ways does humor help you handle stress?",
    "How do you express optimism in difficult moments?",
    "What helps you avoid sarcasm when frustrated?",
    "How do you share your feelings openly during conflict?",
    "When do you rely on creativity to solve problems?",
    "How do you prevent exaggeration in expressing your views?",
    "What role does joy play in your problem-solving style?",
    "How do you speak up without avoiding the real issue?",
    "In what ways do you inspire positivity during struggles?"
  ],
  "4": [
    "How do you bring stability to unsettled situations?",
    "In what ways do you use logic to resolve problems?",
    "How do you organize your thoughts under pressure?",
    "What helps you avoid being overly rigid in conflict?",
    "How do you stay persistent when solutions take time?",
    "When do you rely on structure to bring clarity?",
    "How do you balance practicality with flexibility?",
    "What role does patience play in your decision-making?",
    "How do you ground others during stressful times?",
    "In what ways do you use discipline to resolve conflict?"
  ],
  "5": [
    "How do you adapt when unexpected problems arise?",
    "In what ways do you stay open-minded under pressure?",
    "How do you use flexibility to calm tension?",
    "What helps you avoid restlessness when stressed?",
    "How do you balance freedom with responsibility in conflicts?",
    "When do you rely on quick thinking to find solutions?",
    "How do you manage fear of change during challenges?",
    "What role does adaptability play in resolving disputes?",
    "How do you keep balance while exploring new options?",
    "In what ways do you practice responsible flexibility?"
  ],
  "6": [
    "How do you bring fairness to difficult situations?",
    "In what ways do you respond with compassion during conflict?",
    "How do you balance responsibility with self-care?",
    "What helps you avoid being overly controlling?",
    "How do you nurture peace when emotions run high?",
    "When do you feel pulled to sacrifice too much?",
    "How do you show care without losing objectivity?",
    "What role does service play in your problem-solving?",
    "How do you create harmony in family or group challenges?",
    "In what ways do you practice balanced responsibility?"
  ],
  "7": [
    "How do you bring calm reflection to tense moments?",
    "In what ways do you use analysis before reacting?",
    "How do you balance wisdom with practical action?",
    "What helps you avoid overthinking in conflict?",
    "How do you step back without becoming isolated?",
    "When do you trust intuition instead of logic?",
    "How do you seek deeper meaning during challenges?",
    "What role does patience play in your problem-solving?",
    "How do you handle emotional storms with detachment?",
    "In what ways do you use reflection to create peace?"
  ],
  "8": [
    "How do you show strength in conflict without dominating?",
    "In what ways do you lead with confidence under stress?",
    "How do you balance ambition with fairness in decisions?",
    "What helps you avoid misuse of authority?",
    "How do you command respect without force?",
    "When do you struggle with fear of success in challenges?",
    "How do you manage material concerns during conflict?",
    "What role does leadership play in resolving disputes?",
    "How do you balance firmness with compassion?",
    "In what ways do you use power responsibly?"
  ],
  "9": [
    "How do you bring compassion to conflicts?",
    "In what ways do you forgive and let go of tension?",
    "How do you see the bigger picture during disputes?",
    "What helps you avoid moral superiority in challenges?",
    "How do you respond with love instead of judgment?",
    "When do you struggle with letting go of control?",
    "How do you embrace service in problem-solving?",
    "What role does empathy play in finding peace?",
    "How do you practice universal love in daily conflicts?",
    "In what ways do you turn challenges into healing opportunities?"
  ],
  "11": [
    "How do you use intuition to resolve conflicts?",
    "In what ways do you sense the emotions of others?",
    "How do you balance empathy with self-protection?",
    "What helps you avoid emotional overwhelm in challenges?",
    "How do you bring harmony to difficult conversations?",
    "When do you feel called to mediate for others?",
    "How do you trust your inner voice in problem-solving?",
    "What role does spiritual awareness play in conflict resolution?",
    "How do you guide others toward peace through example?",
    "In what ways do you balance sensitivity with strength?"
  ],
  "22": [
    "How do you unite people toward constructive solutions?",
    "In what ways do you stay patient when resolving conflict?",
    "How do you bring vision and practicality together?",
    "What helps you avoid controlling tendencies in challenges?",
    "How do you balance responsibility with flexibility?",
    "When do you feel pressure to carry too much?",
    "How do you use long-term thinking in problem-solving?",
    "What role does teamwork play in your conflict response?",
    "How do you guide others toward shared goals?",
    "In what ways do you practice visionary problem-solving?"
  ],
  "33": [
    "How do you respond with unconditional love in conflicts?",
    "In what ways do you uplift others during challenges?",
    "How do you balance service with self-care?",
    "What helps you avoid sacrificing too much of yourself?",
    "How do you use wisdom to heal difficult situations?",
    "When do you step in as a healer during disputes?",
    "How do you inspire others with compassion under stress?",
    "What role does patience play in your service response?",
    "How do you share healing energy without feeling drained?",
    "In what ways do you practice love as a problem-solving tool?"
  ]
},
  "PersonalYear": {
    "1": [
      "How can I step into new beginnings this year with confidence?",
      "In what ways can I show more independence in my choices?",
      "How should I use this year to plant seeds for future growth?",
      "What opportunities are opening that require me to take initiative?",
      "How can I balance ambition with patience this year?",
      "What habits should I build to support fresh starts?",
      "How can I embrace change without fear of failure?",
      "What areas of life need bold action now?",
      "How can I avoid rushing and instead plan carefully?",
      "What leadership qualities should I express more strongly this year?"
    ],
    "2": [
      "How can I build stronger partnerships this year?",
      "What role does patience play in my personal growth now?",
      "How can I better cooperate with others in reaching goals?",
      "In what ways can I develop my emotional sensitivity?",
      "How should I use intuition when making decisions this year?",
      "How can I avoid dependency and find my own balance?",
      "What relationships need more harmony and care?",
      "How can I listen more deeply in my interactions?",
      "What steps can I take to strengthen teamwork?",
      "How can I stay steady during periods of slow progress?"
    ],
    "3": [
      "How can I express myself more freely this year?",
      "In what ways can I use creativity to enrich my life?",
      "What role does communication play in my growth this year?",
      "How can I bring more joy and optimism into daily life?",
      "What talents should I share with others now?",
      "How can I avoid scattering my energy and stay focused?",
      "How can I build stronger social connections this year?",
      "In what ways can I use humor and positivity to inspire?",
      "How can I open up emotionally without fear?",
      "What opportunities exist for public recognition of my skills?"
    ],
    "4": [
      "How can I build stronger foundations this year?",
      "What role does discipline play in reaching my goals?",
      "How should I organize my time and energy effectively?",
      "What structures need to be created for long-term stability?",
      "How can I balance hard work with personal well-being?",
      "What lessons can persistence teach me this year?",
      "In what ways can I bring more order to my life?",
      "How should I approach planning for the future?",
      "How can I stay grounded when challenges arise?",
      "What daily habits will strengthen my success this year?"
    ],
    "5": [
      "How can I embrace change with courage this year?",
      "In what ways can I explore freedom responsibly?",
      "What new experiences can bring personal growth?",
      "How should I adapt to sudden opportunities or shifts?",
      "How can I avoid impulsiveness in major decisions?",
      "What role does flexibility play in my success this year?",
      "How can I balance adventure with responsibility?",
      "What outdated patterns should I release now?",
      "How can I make transitions smoother and easier?",
      "What new perspectives will broaden my outlook this year?"
    ],
    "6": [
      "How can I strengthen my family and home life this year?",
      "In what ways can I take on more responsibility with love?",
      "How can I balance caring for others with caring for myself?",
      "What commitments should I honor this year?",
      "How can I nurture relationships more deeply?",
      "In what ways can I serve my community or loved ones?",
      "How should I approach fairness in family matters?",
      "How can I bring harmony into my surroundings?",
      "What lessons in compassion can I embrace this year?",
      "How can I avoid over-control while being supportive?"
    ],
    "7": [
      "How can I focus more on inner reflection this year?",
      "In what ways can I deepen my spiritual awareness?",
      "What role does solitude play in my personal growth?",
      "How can I use study and learning to enrich myself?",
      "What inner truths should I pay attention to this year?",
      "How can I balance logic with intuition?",
      "What practices can strengthen my faith in life?",
      "How should I handle periods of withdrawal or quiet?",
      "How can I cultivate wisdom in my choices?",
      "In what ways can I use insight to guide others?"
    ],
    "8": [
      "How can I focus on achievement this year?",
      "In what ways can I strengthen my financial discipline?",
      "What role does leadership play in my growth this year?",
      "How can I balance ambition with integrity?",
      "What practical steps can lead me to recognition?",
      "How can I avoid burnout while pursuing goals?",
      "In what areas can I demonstrate authority effectively?",
      "How should I manage money and resources wisely?",
      "How can I stay confident in high-pressure situations?",
      "What achievements will define my success this year?"
    ],
    "9": [
      "How can I gracefully let go of what no longer serves me?",
      "In what ways can I embrace endings as new beginnings?",
      "What role does forgiveness play in my growth this year?",
      "How can I cultivate compassion for others?",
      "What humanitarian efforts can I focus on this year?",
      "How can I use this year to prepare for renewal?",
      "What lessons come from completing cycles in my life?",
      "How can I release emotional burdens I’ve carried?",
      "In what ways can I serve others with love?",
      "How can I expand my vision to see the bigger picture?"
    ],
    "11": [
      "How can I use heightened intuition wisely this year?",
      "In what ways can I serve as a guide for others?",
      "What role does spiritual awakening play in my growth now?",
      "How should I channel my sensitivity into positive action?",
      "What insights can I share to uplift people around me?",
      "How can I avoid emotional overwhelm during challenges?",
      "In what ways can I strengthen my spiritual practices?",
      "How can I balance inner growth with outer responsibilities?",
      "What opportunities exist for teaching or mentoring?",
      "How can I stay grounded while experiencing deep insights?"
    ],
    "22": [
      "How can I use this year to build something lasting?",
      "In what ways can I turn big dreams into reality?",
      "What role does patience play in my success now?",
      "How should I balance vision with practical steps?",
      "How can I unite people toward a shared purpose?",
      "What responsibilities must I embrace this year?",
      "How can I avoid fear of failure in big projects?",
      "What goals can leave a long-term impact on others?",
      "In what ways can I serve the greater good with my efforts?",
      "How can I remain steady while managing large responsibilities?"
    ],
    "33": [
      "How can I focus on service and healing this year?",
      "In what ways can I express unconditional love daily?",
      "What role does compassion play in my leadership now?",
      "How should I balance giving to others with caring for myself?",
      "What opportunities exist for spiritual or humanitarian work?",
      "How can I inspire others through wisdom and kindness?",
      "In what ways can I bring healing to my community?",
      "How can I avoid over-sacrifice while serving others?",
      "What lessons of love and forgiveness should I embrace?",
      "How can I create harmony through teaching and guidance?"
    ]
  },
    "Pinnacles Stage1": {
    "1": [
      "How can you develop self-reliance early in life?",
      "In what way does taking initiative shape your early experiences?",
      "How do you learn to stand strong when authority challenges you?",
      "What role does independence play in your early growth?",
      "How can willpower help you overcome early obstacles?",
      "What lessons come from leading instead of following?",
      "How do you balance self-confidence with patience?",
      "In what way does early independence prepare you for adulthood?",
      "How can standing out shape your identity in youth?",
      "What challenges teach you decisiveness early in life?"
    ],
    "2": [
      "How do you learn patience in your early years?",
      "In what way does cooperation help you in youth?",
      "How do early partnerships influence your growth?",
      "What lessons come from learning to compromise?",
      "How does sensitivity shape your early interactions?",
      "How can diplomacy help you handle conflicts in youth?",
      "What role does harmony play in your personal development?",
      "How do you grow from balancing independence and dependency?",
      "In what way do relationships teach you emotional awareness?",
      "How do you build strength through gentleness early in life?"
    ],
    "3": [
      "How do you express creativity in your early life?",
      "In what way does communication shape your youth?",
      "How can imagination help you overcome childhood challenges?",
      "What lessons come from being playful and expressive?",
      "How do social circles influence your personality in youth?",
      "In what way does joy of expression guide your growth?",
      "How can scattered focus be turned into creativity?",
      "How do you find balance between fun and responsibility?",
      "What role does self-expression play in your identity?",
      "How do you learn confidence through early performance?"
    ],
    "4": [
      "How do you learn discipline during your early years?",
      "In what way does structure guide your personality in youth?",
      "How do early responsibilities shape your reliability?",
      "What lessons come from building stable habits?",
      "How do you handle feeling restricted in childhood?",
      "How does persistence shape your early identity?",
      "In what way do rules teach you about responsibility?",
      "How do you grow through building strong foundations?",
      "What role does order play in your personal growth?",
      "How do you balance freedom with structure early in life?"
    ],
    "5": [
      "How does variety shape your early experiences?",
      "In what way do changes in youth make you adaptable?",
      "How do you learn freedom without losing focus?",
      "What lessons come from early instability?",
      "How does curiosity guide your personal growth?",
      "In what way does adventure shape your young personality?",
      "How do you handle restlessness in youth?",
      "How can flexibility help you overcome challenges?",
      "What role does movement play in shaping your identity?",
      "How do you grow through exploring new possibilities?"
    ],
    "6": [
      "How do you learn responsibility in your early years?",
      "In what way does family shape your personality in youth?",
      "How do early obligations teach you commitment?",
      "What lessons come from nurturing others as a child?",
      "How do you balance caring for others and yourself?",
      "In what way does compassion guide your early growth?",
      "How does loyalty shape your identity in youth?",
      "How do you handle over-responsibility early in life?",
      "What role does fairness play in your young decisions?",
      "How do relationships teach you about service in youth?"
    ],
    "7": [
      "How do you explore knowledge early in life?",
      "In what way does introspection guide your youth?",
      "How do you learn through observation as a child?",
      "What lessons come from solitude in your early years?",
      "How does spirituality shape your young personality?",
      "In what way does curiosity for deeper truths grow in youth?",
      "How do you balance logic with intuition early in life?",
      "How does reflection guide your early development?",
      "What role does wisdom play in childhood challenges?",
      "How do you grow by seeking answers within?"
    ],
    "8": [
      "How does ambition show up in your early life?",
      "In what way do you learn about power as a child?",
      "How do early experiences with authority shape you?",
      "What lessons come from striving for success young?",
      "How do you handle control struggles in youth?",
      "How does responsibility guide your early growth?",
      "In what way do material goals affect your personality?",
      "How do you build confidence through achievement?",
      "What role does leadership play in your young identity?",
      "How do you balance power with fairness early in life?"
    ],
    "9": [
      "How do you learn compassion in your early years?",
      "In what way does empathy guide your personality in youth?",
      "How do early experiences teach you forgiveness?",
      "What lessons come from serving others young?",
      "How does idealism shape your childhood dreams?",
      "In what way does sensitivity teach you strength?",
      "How do you handle letting go early in life?",
      "How does creativity connect with compassion in youth?",
      "What role does justice play in your young identity?",
      "How do you grow through humanitarian awareness?"
    ],
    "11": [
      "How does intuition show up early in your life?",
      "In what way do spiritual insights guide your youth?",
      "How do you learn to trust your inner vision?",
      "What lessons come from heightened sensitivity in childhood?",
      "How does creativity shape your early personality?",
      "In what way do you inspire others in youth?",
      "How do you balance emotional intensity early on?",
      "How does visionary thinking guide your growth?",
      "What role does spiritual awareness play in your identity?",
      "How do you use your gifts to guide others in youth?"
    ],
    "22": [
      "How do you learn discipline and vision early in life?",
      "In what way do you show leadership as a child?",
      "How do early responsibilities prepare you for big goals?",
      "What lessons come from blending practicality with dreams?",
      "How does ambition guide your young personality?",
      "In what way do you build strong foundations in youth?",
      "How do you handle pressure at a young age?",
      "How does responsibility shape your early growth?",
      "What role does vision play in your early decisions?",
      "How do you balance practicality and inspiration early in life?"
    ],
    "33": [
      "How do you learn compassion early in life?",
      "In what way does service shape your young personality?",
      "How do you discover healing abilities in youth?",
      "What lessons come from unconditional love early on?",
      "How does nurturing guide your early growth?",
      "In what way do you inspire others through care in youth?",
      "How do you handle emotional intensity as a child?",
      "How does wisdom connect with compassion early in life?",
      "What role does selflessness play in your identity?",
      "How do you grow by uplifting others in youth?"
    ]
    },
    "Pinnacles Stage2": {
     "1": [
      "How can you assert independence in your career path during this stage?",
      "In what way does self-mastery guide your adult decisions?",
      "How can leadership opportunities strengthen your identity?",
      "What risks feel worth taking to build your future?",
      "How does defining your personal path bring fulfillment?",
      "What challenges in partnerships teach you about balance?",
      "In what ways can you embrace courage when facing setbacks?",
      "How can building self-reliance improve your confidence?",
      "What role does innovation play in your growth now?",
      "How can you stand out while staying true to yourself?"
    ],
    "2": [
      "How can patience help you navigate relationships in this stage?",
      "In what ways does cooperation bring harmony to adulthood?",
      "How does teamwork support your personal growth?",
      "What lessons in diplomacy are shaping your path?",
      "How can you balance sensitivity with strength?",
      "How do deep connections influence your decisions now?",
      "What role does intuition play in your adult choices?",
      "How can you avoid indecision while staying cooperative?",
      "What practices help you maintain inner peace?",
      "How can you strengthen partnerships without losing yourself?"
    ],
    "3": [
      "How can creativity expand your opportunities in adulthood?",
      "In what ways does self-expression attract growth now?",
      "How do communication skills shape your career path?",
      "What role does joy play in your success at this stage?",
      "How can you channel imagination into practical outcomes?",
      "What risks come with scattered focus in this period?",
      "How can social connections support your goals?",
      "How do you express optimism in your daily life?",
      "What opportunities allow you to inspire others?",
      "How can you refine your talents for lasting success?"
    ],
    "4": [
      "How can building structure create long-term stability now?",
      "What role does perseverance play in your career growth?",
      "How can responsibility define your adulthood progress?",
      "In what ways can discipline lead to security?",
      "What lessons come from feeling restricted in this stage?",
      "How do strong foundations support your ambitions?",
      "How can you balance work and personal life effectively?",
      "What habits ensure steady growth for your future?",
      "How do you handle the weight of obligations at this time?",
      "How can reliability become a source of pride?"
    ],
    "5": [
      "How can you embrace freedom while staying grounded?",
      "What role does travel or change play in your growth?",
      "How do new experiences transform your perspective?",
      "In what ways does variety enrich your adulthood path?",
      "How can adaptability help you overcome challenges?",
      "What risks come with seeking constant excitement?",
      "How do you find balance between freedom and responsibility?",
      "What breakthroughs come from exploring the unknown?",
      "How can restlessness be turned into opportunity?",
      "In what ways can you grow through personal transformation?"
    ],
    "6": [
      "How does responsibility shape your adulthood experience?",
      "In what ways does love deepen your commitments?",
      "How do family roles influence your growth now?",
      "What lessons come from balancing care with self-needs?",
      "How can service to others bring harmony?",
      "What challenges arise from over-responsibility?",
      "How can nurturing relationships strengthen your path?",
      "In what ways does loyalty guide your adult choices?",
      "How do you balance personal freedom with obligations?",
      "How can healing others also heal you?"
    ],
    "7": [
      "How can reflection lead to deeper wisdom in adulthood?",
      "In what ways does study or learning expand your path?",
      "How can spirituality guide your decisions now?",
      "What truths are you seeking in this stage?",
      "How can solitude strengthen your growth?",
      "What risks come from over-analyzing situations?",
      "How can observation help you understand others?",
      "In what ways does research or philosophy inspire you?",
      "How do you balance inner reflection with outer action?",
      "What wisdom do you want to share with others?"
    ],
    "8": [
      "How can ambition drive your adulthood success?",
      "What role does authority play in your growth?",
      "How can financial stability empower your future?",
      "In what ways does responsibility strengthen your leadership?",
      "How do you handle control or power struggles?",
      "How can achievement bring both material and personal rewards?",
      "What risks come from misusing influence?",
      "How can recognition motivate you positively?",
      "What role does discipline play in your success?",
      "How can you build a lasting legacy now?"
    ],
    "9": [
      "How does compassion shape your adulthood choices?",
      "In what ways does service bring fulfillment?",
      "How can art or creativity support your growth now?",
      "What role does justice play in your adult path?",
      "How can empathy guide your relationships?",
      "What lessons come from letting go of the past?",
      "How does humanitarian work inspire your purpose?",
      "In what ways can you express idealism practically?",
      "How can awareness of global needs influence you?",
      "What healing comes from emotional maturity?"
    ],
    "11": [
      "How does intuition guide your adulthood growth?",
      "In what ways can creativity inspire your path now?",
      "How do you express your visionary nature in work or life?",
      "What lessons come from emotional intensity?",
      "How can teaching or guiding others bring fulfillment?",
      "What practices strengthen your inner balance?",
      "How can spiritual insights shape your adulthood decisions?",
      "In what ways do nervous challenges teach resilience?",
      "How can inspiration flow through your relationships?",
      "What role does sensitivity play in shaping your identity?"
    ],
    "22": [
      "How can you balance vision with practicality in adulthood?",
      "What role does discipline play in building large goals?",
      "How can leadership expand your influence now?",
      "What pressures come with high expectations?",
      "In what ways can you create something lasting?",
      "How do you overcome fear of failure at this stage?",
      "How can ambition be channeled positively?",
      "What foundations are you laying for the future?",
      "How can your skills blend practicality with inspiration?",
      "What opportunities allow you to impact others broadly?"
    ],
    "33": [
      "How does compassion guide your adulthood path?",
      "In what ways can healing become your purpose now?",
      "How do love and responsibility shape your growth?",
      "What risks come with over-sacrifice?",
      "How can teaching inspire both you and others?",
      "In what ways does creativity support your nurturing role?",
      "How can empathy expand your influence in adulthood?",
      "What lessons come from emotional intensity at this stage?",
      "How do you balance service with self-care?",
      "How can you live unconditional love fully in this period?"
    ]
    },
    "Pinnacles Stage3": {
     "1": [
      "How can independence bring deeper fulfillment in midlife?",
      "In what ways does self-driven success shape maturity now?",
      "How can leadership roles provide satisfaction at this stage?",
      "How does innovation define fulfillment during maturity?",
      "What role does originality play in shaping midlife growth?",
      "How can self-mastery create lasting rewards now?",
      "In what ways can courage ensure fulfillment during maturity?",
      "How does recognition for independence bring happiness at this age?",
      "How can originality inspire others during midlife?",
      "What does balancing independence with humility mean at this stage?"
    ],
    "2": [
      "How can harmony bring peace during maturity?",
      "In what ways do partnerships create midlife fulfillment?",
      "How does sensitivity guide happiness at this stage?",
      "How can cooperation support maturity and balance?",
      "What role does intuition play in midlife growth?",
      "How does patience bring deeper peace during this phase?",
      "In what ways does love shape fulfillment now?",
      "How can emotional balance create happiness at this age?",
      "How does shared growth bring satisfaction during maturity?",
      "What does avoiding over-dependence mean for fulfillment now?"
    ],
    "3": [
      "How can creativity flourish in midlife maturity?",
      "What role does joy play in fulfillment at this stage?",
      "In what ways does expression inspire others now?",
      "How can communication strengthen midlife happiness?",
      "How does optimism shape fulfillment during maturity?",
      "What role do friendships and social life play in this stage?",
      "How can artistic pursuits create meaning in maturity?",
      "In what ways does humor bring peace now?",
      "How can imagination lead to lasting satisfaction?",
      "What does avoiding superficiality mean for fulfillment at this age?"
    ],
    "4": [
      "How does discipline support fulfillment during maturity?",
      "In what ways can structure bring peace in midlife?",
      "How does responsibility create rewards at this stage?",
      "How can long-term efforts bring stability now?",
      "What role does patience play in fulfillment during maturity?",
      "How can building strong foundations create security?",
      "In what ways does order support peace in midlife?",
      "How can reliability bring satisfaction at this age?",
      "How does careful planning shape happiness during maturity?",
      "What does breaking free from routine mean in midlife?"
    ],
    "5": [
      "How can freedom bring fulfillment in maturity?",
      "In what ways does change create midlife satisfaction?",
      "How does adaptability strengthen happiness at this stage?",
      "What role does travel or exploration play in fulfillment now?",
      "How can curiosity bring growth during maturity?",
      "How does embracing variety create meaning at this age?",
      "In what ways can adventure strengthen self-discovery?",
      "How can flexibility ensure peace during midlife?",
      "How does freedom of choice define happiness now?",
      "What does commitment mean for fulfillment during maturity?"
    ],
    "6": [
      "How does nurturing bring fulfillment in midlife?",
      "In what ways does love shape maturity at this stage?",
      "How can responsibility deepen satisfaction now?",
      "What role does family play in fulfillment during maturity?",
      "How can caregiving create happiness at this age?",
      "How does teaching or guiding others bring peace?",
      "In what ways does harmony support fulfillment in maturity?",
      "How can devotion to loved ones create meaning?",
      "What does service bring to midlife happiness?",
      "How does balancing care for self and others support fulfillment?"
    ],
    "7": [
      "How does wisdom bring fulfillment in maturity?",
      "In what ways does reflection create peace now?",
      "How can study or spiritual growth shape midlife?",
      "What role does solitude play in maturity happiness?",
      "How does intuition guide fulfillment at this stage?",
      "In what ways can teaching or mentoring bring peace?",
      "How does truth-seeking bring satisfaction during maturity?",
      "How can inner growth create meaning now?",
      "What does avoiding withdrawal mean for midlife balance?",
      "How can quiet wisdom inspire others during maturity?"
    ],
    "8": [
      "How does ambition shape fulfillment in midlife?",
      "In what ways does power bring satisfaction during maturity?",
      "How can wealth create meaning now?",
      "What role does recognition play in midlife happiness?",
      "How does leadership strengthen fulfillment at this stage?",
      "In what ways can discipline ensure lasting success?",
      "How can influence create satisfaction in maturity?",
      "What does responsibility in power mean for happiness now?",
      "How does material success reflect maturity fulfillment?",
      "How can using authority wisely deepen midlife growth?"
    ],
    "9": [
      "How does compassion bring fulfillment in maturity?",
      "In what ways does service shape midlife happiness?",
      "How can humanitarian work create meaning now?",
      "What role does forgiveness play in this stage of life?",
      "How does creativity reflect compassion during maturity?",
      "In what ways does justice support fulfillment now?",
      "How can empathy strengthen relationships during midlife?",
      "How does awareness of collective needs shape happiness?",
      "What does letting go mean for maturity fulfillment?",
      "How can emotional growth bring peace in midlife?"
    ],
    "11": [
      "How does inspiration shape fulfillment in maturity?",
      "In what ways does intuition bring peace during midlife?",
      "How can creativity guide growth at this stage?",
      "What role does teaching play in fulfillment now?",
      "How can visionary work bring meaning during maturity?",
      "How does spiritual growth create peace in midlife?",
      "In what ways can healing inspire fulfillment?",
      "How can inner light guide happiness at this stage?",
      "What does higher awareness mean for maturity now?",
      "How can guidance to others bring joy in midlife?"
    ],
    "22": [
      "How does legacy work create fulfillment in maturity?",
      "In what ways does vision shape midlife happiness?",
      "How can building lasting foundations bring meaning now?",
      "What role does leadership play in fulfillment during maturity?",
      "How does ambition create satisfaction at this stage?",
      "In what ways can balancing vision and reality bring peace?",
      "How can discipline ensure meaningful success in midlife?",
      "What does practical achievement mean for maturity happiness?",
      "How can influence shape fulfillment during this stage?",
      "How does creating something lasting bring peace now?"
    ],
    "33": [
      "How does compassion bring fulfillment in maturity?",
      "In what ways does teaching inspire midlife happiness?",
      "How can healing create meaning during this stage?",
      "What role does love play in fulfillment now?",
      "How can service bring peace in maturity?",
      "In what ways does responsibility for others bring joy?",
      "How can guiding younger generations create meaning now?",
      "What does unconditional love mean in midlife?",
      "How does empathy deepen fulfillment at this stage?",
      "How can wisdom expressed through compassion bring peace now?"
    ]
    },
    "Pinnacles Stage4": {
    "1": [
      "How can you maintain independence while enjoying companionship in later life?",
      "In what ways can your self-reliance inspire younger generations?",
      "How do you balance freedom with the need for connection as you age?",
      "How can you express your leadership without becoming isolated?",
      "In what ways can you use your authority to guide others with kindness?",
      "How can independence bring you peace and fulfillment in later years?",
      "What personal achievements define your legacy of strength?",
      "How can you share your pioneering spirit with family or community?",
      "How do you maintain confidence without becoming overly detached?",
      "What does living life fully on your own terms mean at this stage?"
    ],
    "2": [
      "How can patience and harmony bring comfort in later years?",
      "In what ways do close relationships shape your fulfillment now?",
      "How can you deepen your intuition to guide younger generations?",
      "What practices help you cultivate peace in your daily life?",
      "How can cooperation bring healing and joy in your legacy?",
      "How do you avoid over-sensitivity while staying compassionate?",
      "In what ways can your calm nature inspire those around you?",
      "How can you create balance between giving and receiving love?",
      "What role does emotional connection play in your lasting happiness?",
      "How do you strengthen bonds that matter most in your later years?"
    ],
    "3": [
      "How can joy and creativity shape your legacy in later life?",
      "In what ways can your playful nature bring happiness to others?",
      "How can you express yourself through teaching or mentoring now?",
      "What role does laughter and optimism play in your fulfillment?",
      "How can you use communication to pass wisdom to the next generation?",
      "How do you avoid superficiality while enjoying lightheartedness?",
      "In what ways can you share your artistic or expressive gifts?",
      "How can social connections bring meaning in your later years?",
      "What creative outlets bring you the deepest satisfaction now?",
      "How do you balance joy with meaningful purpose at this stage?"
    ],
    "4": [
      "How can stability and structure bring peace in your later years?",
      "In what ways can you enjoy the foundations you’ve built?",
      "How do routines support your comfort and well-being now?",
      "How can you share lessons of discipline with others?",
      "What role does responsibility play in your fulfillment at this stage?",
      "How do you avoid rigidity while valuing structure?",
      "In what ways can you create security for loved ones?",
      "How can you celebrate the rewards of your steady efforts?",
      "What practices help you feel grounded and at ease?",
      "How do you build a legacy rooted in reliability and strength?"
    ],
    "5": [
      "How can freedom and variety enrich your later years?",
      "In what ways can travel or exploration shape your legacy?",
      "How do you stay adaptable and open-minded as you age?",
      "How can continuous learning bring joy to your life now?",
      "What adventures still excite you in this stage of life?",
      "How do you balance freedom with a sense of stability?",
      "In what ways can your flexibility inspire younger generations?",
      "How can you avoid restlessness while enjoying change?",
      "What role does curiosity play in your fulfillment at this stage?",
      "How do you embrace life as a journey of discovery now?"
    ],
    "6": [
      "How can love and responsibility bring harmony in later years?",
      "In what ways can you nurture family or community now?",
      "How do you balance caregiving with self-care at this stage?",
      "How can your wisdom serve as guidance for loved ones?",
      "What role does teaching or mentoring play in your legacy?",
      "How do you avoid feeling overburdened by responsibility?",
      "In what ways can you strengthen bonds through compassion?",
      "How can acts of service bring fulfillment in your later years?",
      "What does unconditional love mean to you at this stage?",
      "How do you create a lasting legacy of warmth and care?"
    ],
    "7": [
      "How can wisdom and reflection shape your later life?",
      "In what ways can you share spiritual insights with others?",
      "How do you find peace through solitude and study now?",
      "How can teaching or guiding others bring fulfillment?",
      "What practices deepen your inner calm at this stage?",
      "How do you avoid isolation while valuing reflection?",
      "In what ways can you pass on your accumulated knowledge?",
      "How can meditation or contemplation enrich your legacy?",
      "What role does spirituality play in your fulfillment now?",
      "How do you embody wisdom as your lasting contribution?"
    ],
    "8": [
      "How can achievement and recognition define your later years?",
      "In what ways can you enjoy the rewards of your ambition?",
      "How do you use your authority to uplift others now?",
      "How can leadership serve as part of your legacy?",
      "What role does financial security play in your fulfillment?",
      "How do you avoid attachment to status at this stage?",
      "In what ways can you share your success with community?",
      "How can practical achievements leave lasting impact?",
      "What does true power and influence mean to you now?",
      "How do you balance ambition with inner peace in later years?"
    ],
    "9": [
      "How can compassion and service shape your later years?",
      "In what ways can you complete emotional and spiritual cycles?",
      "How do you use your wisdom for humanitarian purposes?",
      "How can art or creativity be part of your legacy?",
      "What role does forgiveness play in your fulfillment now?",
      "How do you avoid clinging while embracing closure?",
      "In what ways can you inspire others through kindness?",
      "How can global awareness guide your later contributions?",
      "What does emotional healing mean to you at this stage?",
      "How do you express completion in your life’s journey?"
    ],
    "11": [
      "How can your intuition guide others in later life?",
      "In what ways can you inspire through teaching or creativity?",
      "How do you balance visionary insight with emotional steadiness?",
      "How can your presence bring illumination to those around you?",
      "What role does spiritual wisdom play in your legacy?",
      "How do you avoid emotional strain while inspiring others?",
      "In what ways can you share your creativity with the world?",
      "How can your intuition create harmony in your later years?",
      "What practices help you channel inspiration effectively?",
      "How do you embody illumination as a guide or mentor?"
    ],
    "22": [
      "How can your legacy-building efforts define your later years?",
      "In what ways can you create something lasting and impactful?",
      "How do you balance ambition with peace at this stage?",
      "How can your leadership unite people toward meaningful goals?",
      "What role does patience play in your fulfillment now?",
      "How do you avoid pressure while carrying responsibility?",
      "In what ways can your practical vision inspire others?",
      "How can your mastery leave a strong legacy for future generations?",
      "What achievements reflect your greatest fulfillment now?",
      "How do you blend strength with wisdom in your later years?"
    ],
    "33": [
      "How can compassion and service define your later life?",
      "In what ways can you guide others as a universal teacher?",
      "How do you balance selfless giving with personal care?",
      "How can your healing presence inspire future generations?",
      "What role does unconditional love play in your legacy?",
      "How do you avoid over-sacrifice while helping others?",
      "In what ways can you spread wisdom through compassion?",
      "How can you create harmony through teaching and guidance?",
      "What practices help you stay energized in service?",
      "How do you embody love as your lasting contribution to the world?"
    ]
    },
    "Challenges Stage1": {
     "1": [
      "In what ways can you build self-confidence when faced with new situations?",
      "How can you strengthen independence without shutting others out?",
      "What steps help you overcome hesitation in making decisions?",
      "How might you practice courage in daily life?",
      "In what ways can you assert yourself kindly but firmly?",
      "How can challenges teach you leadership and initiative?",
      "What helps you move beyond fear of failure?",
      "How can you trust your own ideas more deeply?",
      "In what ways can setbacks build resilience in you?",
      "How can you turn self-doubt into self-mastery?"
    ],
    "2": [
      "How can you create healthy boundaries in relationships?",
      "In what ways can you balance cooperation with self-respect?",
      "What practices help you manage emotional sensitivity?",
      "How can you speak your truth without fearing conflict?",
      "What helps you avoid over-dependence on others?",
      "How can you strengthen patience with yourself and others?",
      "In what ways can you cultivate inner peace during disagreements?",
      "How might you practice decision-making with confidence?",
      "What helps you grow trust in your own worth?",
      "How can vulnerability become a strength instead of a weakness?"
    ],
    "3": [
      "How can you express emotions more openly and authentically?",
      "What steps help you overcome fear of speaking up?",
      "In what ways can you nurture your creativity daily?",
      "How can social interactions become more joyful for you?",
      "What helps you move past self-doubt in communication?",
      "How can playfulness improve your sense of purpose?",
      "What role can journaling or art play in healing expression?",
      "In what ways can you connect with others through optimism?",
      "How might you stay focused when energy feels scattered?",
      "How can embracing joy help you overcome challenges?"
    ],
    "4": [
      "How can you build discipline without feeling restricted?",
      "What helps you accept structure as supportive instead of limiting?",
      "In what ways can patience guide your progress?",
      "How can small routines bring stability into your life?",
      "What steps can you take to overcome resistance to responsibility?",
      "How can you turn obstacles into building blocks?",
      "What helps you stay grounded during stressful times?",
      "How might you create balance between flexibility and discipline?",
      "In what ways can persistence reward you long-term?",
      "How can structure help you feel more secure rather than stuck?"
    ],
    "5": [
      "How can you enjoy freedom without avoiding responsibility?",
      "What helps you stay committed when things get difficult?",
      "In what ways can you channel restlessness into positive action?",
      "How can you balance adventure with stability?",
      "What practices keep you from acting impulsively?",
      "How can you stay grounded while exploring new opportunities?",
      "In what ways can you use change as a teacher?",
      "How might discipline strengthen your sense of freedom?",
      "What helps you avoid escaping challenges you face?",
      "How can adaptability become a tool for growth instead of avoidance?"
    ],
    "6": [
      "How can you balance caring for others with caring for yourself?",
      "In what ways can responsibility feel like love instead of a burden?",
      "How might you release perfectionism in relationships?",
      "What practices help you manage worry about loved ones?",
      "How can you express compassion without controlling?",
      "In what ways can teaching or caregiving bring joy instead of stress?",
      "How might boundaries strengthen family harmony?",
      "What helps you let go of guilt when you prioritize yourself?",
      "How can love be shared freely without over-responsibility?",
      "In what ways can you grow through harmony instead of control?"
    ],
    "7": [
      "How can you learn to trust others while staying true to yourself?",
      "What helps you overcome feelings of isolation?",
      "In what ways can solitude bring wisdom instead of loneliness?",
      "How might you balance skepticism with open-mindedness?",
      "What practices deepen your faith in life’s process?",
      "How can sharing insights help you feel more connected?",
      "In what ways can you grow through self-reflection?",
      "How might you open up emotionally without fear?",
      "What helps you feel supported even when alone?",
      "How can challenges strengthen your inner wisdom?"
    ],
    "8": [
      "How can you create a healthy relationship with money?",
      "What helps you balance ambition with integrity?",
      "In what ways can power be used for service instead of control?",
      "How can you overcome fear of financial loss?",
      "What practices keep authority from becoming domination?",
      "How might fairness guide your decisions in leadership?",
      "In what ways can success feel fulfilling beyond material wealth?",
      "How can generosity balance ambition?",
      "What helps you avoid greed or over-attachment to power?",
      "How can challenges with money or authority shape your growth?"
    ],
    "9": [
      "How can you practice forgiveness when holding onto past pain?",
      "What helps you release what no longer serves you?",
      "In what ways can compassion guide your healing?",
      "How might you let go of resentment to find peace?",
      "What practices encourage acceptance of change?",
      "How can you embrace endings as beginnings?",
      "In what ways can service bring closure to struggles?",
      "How might you open your heart to universal love?",
      "What helps you move forward when feeling stuck in the past?",
      "How can surrender become a path to strength?"
    ],
    "11": [
      "How can you ground yourself during emotional intensity?",
      "What practices help reduce anxiety when inspiration feels overwhelming?",
      "In what ways can you balance intuition with practicality?",
      "How might you transform nervous tension into creative energy?",
      "What helps you trust your inner guidance more deeply?",
      "How can you balance vision with day-to-day responsibilities?",
      "In what ways can you manage swings between doubt and inspiration?",
      "How might you share your insights without fear of judgment?",
      "What helps you stay steady while embracing your spiritual calling?",
      "How can you nurture your sensitivity as a gift instead of a burden?"
    ],
    "22": [
      "How can you take small steps toward big visions?",
      "What helps you avoid procrastination when goals feel overwhelming?",
      "In what ways can responsibility feel empowering instead of heavy?",
      "How might you balance ideals with practical reality?",
      "What practices keep you steady under pressure?",
      "How can you release fear of failure while pursuing big dreams?",
      "In what ways can collaboration ease the weight of responsibility?",
      "How might patience help you manifest long-term goals?",
      "What helps you stay grounded when your vision feels too large?",
      "How can you trust the process of building gradually?"
    ],
    "33": [
      "How can you care for yourself while serving others?",
      "What helps you avoid feeling guilty when you set boundaries?",
      "In what ways can compassion be shared without over-sacrifice?",
      "How might you prevent burnout while supporting others?",
      "What practices remind you that perfection is not required?",
      "How can you balance teaching with self-care?",
      "In what ways can love be unconditional yet healthy?",
      "How might you transform feelings of martyrdom into empowerment?",
      "What helps you release unrealistic expectations of yourself?",
      "How can service bring joy rather than exhaustion?"
    ]
    },
    "Challenges Stage2": {
  "1": [
    "How can you strengthen your independence without pushing others away?",
    "What situations in adulthood make it hardest for you to assert yourself?",
    "In what ways can you step into leadership at work or home?",
    "How do you respond when others try to dominate your decisions?",
    "Where do you still rely too much on external validation?",
    "What practices help you build daily self-confidence?",
    "How can you take initiative in areas you usually hesitate?",
    "In what ways can you balance independence with cooperation?",
    "What patterns of passivity keep you from progress?",
    "How can you transform challenges into leadership opportunities?"
  ],
  "2": [
    "How can you maintain balance in relationships while keeping your self-worth?",
    "In what situations do you avoid conflict, and how does it affect you?",
    "Where do you feel most dependent on others in your adult life?",
    "How do you build confidence while staying cooperative?",
    "What role does emotional sensitivity play in your decision-making?",
    "In what ways can you set healthier boundaries in partnerships?",
    "How can you strengthen your inner voice without fear of rejection?",
    "When do you find it hardest to make decisions on your own?",
    "How can you cultivate peace while still honoring your needs?",
    "What helps you feel both connected and empowered in relationships?"
  ],
  "3": [
    "What holds you back from fully expressing your creativity now?",
    "How can you overcome self-doubt in your professional or social life?",
    "In what ways do you silence your authentic voice?",
    "Where do you feel blocked in expressing emotions to others?",
    "How can you turn scattered energy into focused projects?",
    "What role does communication play in your adult relationships?",
    "How do you balance lighthearted joy with responsibility?",
    "In what ways can you overcome fear of criticism when speaking?",
    "Where can creative expression bring healing to your life?",
    "How can you embrace joy without avoiding deeper issues?"
  ],
  "4": [
    "What responsibilities feel most restrictive to you now?",
    "How can you bring structure into your life without feeling trapped?",
    "In what ways do you resist discipline or routine?",
    "Where do you struggle most with persistence and patience?",
    "How can you turn obligations into opportunities for growth?",
    "What role does stability play in your adult security?",
    "How do you handle feelings of limitation or lack of freedom?",
    "Where can you apply more practical focus to succeed?",
    "What beliefs make you rigid or resistant to change?",
    "How can you create strong foundations without losing flexibility?"
  ],
  "5": [
    "Where does restlessness show up most in your adult life?",
    "How can you enjoy freedom without neglecting responsibility?",
    "What commitments do you often avoid or resist?",
    "How do you handle impulsive decisions that backfire?",
    "In what ways do you overindulge to escape challenges?",
    "How can adaptability help you grow during this stage?",
    "Where can you embrace change without losing stability?",
    "How do you balance excitement with long-term focus?",
    "What fears make you resist structure and discipline?",
    "How can you transform impulsivity into healthy spontaneity?"
  ],
  "6": [
    "How do responsibilities in family or work affect your balance?",
    "In what ways do you take on too much responsibility for others?",
    "Where do you struggle with perfectionism in adult life?",
    "How can you care for yourself while caring for others?",
    "What role does worry play in your relationships?",
    "How do you handle feeling overburdened by duty?",
    "Where can you let go of control to find harmony?",
    "How do you express healthy love without self-sacrifice?",
    "What boundaries can help you manage responsibility better?",
    "How can compassion guide you without draining your energy?"
  ],
  "7": [
    "How do you handle feelings of isolation in adult life?",
    "In what areas do you struggle to trust others?",
    "How does skepticism affect your relationships and work?",
    "Where do you withdraw too much instead of connecting?",
    "How can you deepen your faith in yourself during challenges?",
    "What role does reflection play in your current growth?",
    "How do you overcome doubt in your spiritual or personal path?",
    "Where can you open up more to those around you?",
    "How does secrecy limit your growth at this stage?",
    "How can solitude become wisdom instead of isolation?"
  ],
  "8": [
    "How do power struggles show up in your adult life?",
    "In what ways do you struggle with financial stability?",
    "Where does fear of loss influence your decisions?",
    "How can you use ambition without becoming controlling?",
    "What role does money play in your self-worth?",
    "How do you handle authority when it feels restrictive?",
    "Where can you practice fairness in leadership roles?",
    "How do you avoid misuse of influence or control?",
    "What lessons are you learning about success and integrity?",
    "How can material challenges help you grow in maturity?"
  ],
  "9": [
    "Where do you struggle most with letting go of the past?",
    "How does forgiveness play a role in your adult growth?",
    "In what ways do you hold onto resentment or pain?",
    "How can you embrace compassion when hurt by others?",
    "Where do you resist endings or necessary change?",
    "What role does acceptance play in your personal peace?",
    "How can you balance service with personal boundaries?",
    "How do you move forward when lessons feel unfinished?",
    "Where do you resist closure, and why?",
    "How can you transform pain into wisdom for others?"
  ],
  "11": [
    "How do you manage intense emotional sensitivity in adult life?",
    "In what situations does nervous tension affect your choices?",
    "How can you ground yourself while following intuition?",
    "Where do you swing between inspiration and self-doubt?",
    "What role does spirituality play in your daily balance?",
    "How can you stay practical while honoring your inner guidance?",
    "How do you handle pressure from your spiritual calling?",
    "Where does anxiety limit your personal growth?",
    "How can you transform sensitivity into strength?",
    "What helps you trust your inner wisdom more deeply?"
  ],
  "22": [
    "Where do you feel overwhelmed by big responsibilities?",
    "How can you break down large visions into practical steps?",
    "What fears of failure hold you back in adulthood?",
    "In what ways do you procrastinate on important goals?",
    "How can you balance spiritual ideals with material demands?",
    "Where do unrealistic expectations create stress for you?",
    "How do you stay grounded while working on big plans?",
    "What lessons are you learning about responsibility and balance?",
    "How can you avoid avoidance when facing challenges?",
    "Where can practical discipline help you manifest goals?"
  ],
  "33": [
    "How do you handle the pressure of others’ expectations?",
    "Where do you sacrifice too much of yourself for others?",
    "How can you balance self-care with caregiving?",
    "What role does guilt play in your adult responsibilities?",
    "In what ways do you struggle with perfectionism?",
    "How can you give love without exhausting yourself?",
    "Where do you feel burdened by duty or sacrifice?",
    "How can healthy boundaries improve your relationships?",
    "What lessons are you learning about unconditional love?",
    "How can you transform over-responsibility into balanced service?"
  ]
    },
    "Challenges Stage3": {
  "1": [
    "How do you continue embracing independence in later years without isolation?",
    "What fears of standing alone still linger as you age?",
    "How can you share your wisdom while staying self-reliant?",
    "Where do you still rely too much on others for direction?",
    "How can courage guide your choices in this stage of life?",
    "What role does decisiveness play in your legacy?",
    "How do you lead by example without needing control?",
    "Where do you avoid initiative out of fear of failure?",
    "How can solitude help you deepen self-confidence?",
    "In what ways can you honor your individuality in later years?"
  ],
  "2": [
    "How can you maintain harmony in relationships as roles change in later life?",
    "Where do you still struggle with compromise or tact?",
    "How can patience help you navigate aging gracefully?",
    "What situations test your diplomacy the most now?",
    "How do you continue building cooperation among family or community?",
    "Where do you still feel overly dependent on others?",
    "How can emotional sensitivity become a gift in later years?",
    "What role does teamwork play in your sense of fulfillment?",
    "How do you maintain balance between giving and receiving support?",
    "How can you honor both peace and authenticity in your later years?"
  ],
  "3": [
    "How do you keep your joy alive as life slows down?",
    "Where do you still hesitate to express your true feelings?",
    "How can creativity enrich your later life?",
    "What role does communication play in sustaining relationships now?",
    "Where do you hold back your authentic self-expression?",
    "How can optimism help you face physical or emotional challenges?",
    "What fears of criticism still affect your voice?",
    "How do you share your joy with the next generation?",
    "Where does laughter still bring healing into your life?",
    "How can you leave behind a legacy of inspiration and openness?"
  ],
  "4": [
    "How do you maintain structure and routine in later years?",
    "Where do you still resist responsibility or discipline?",
    "How can persistence help you age with dignity?",
    "What lessons of reliability still need practice now?",
    "How do you balance order with flexibility as life changes?",
    "Where do you still avoid the effort needed for stability?",
    "How can strong foundations bring peace in later life?",
    "What beliefs about limitations do you still need to release?",
    "How do you transform restrictions into freedom?",
    "In what ways does patience support you at this stage?"
  ],
  "5": [
    "How can you embrace change gracefully in later life?",
    "Where do you still fear losing freedom or independence?",
    "How do you find adventure without recklessness now?",
    "What lessons in moderation still challenge you?",
    "How can adaptability make aging easier?",
    "Where do you resist necessary adjustments in daily life?",
    "How do you balance excitement with stability at this stage?",
    "What role does curiosity play in your personal growth now?",
    "How can you embrace uncertainty without fear?",
    "In what ways can you turn flexibility into wisdom?"
  ],
  "6": [
    "How do you balance family responsibilities with self-care in later years?",
    "Where do you still feel overburdened by duty?",
    "How can compassion guide you without draining your energy now?",
    "What role does fairness play in your relationships at this stage?",
    "How do you handle imbalance in giving and receiving love?",
    "Where do you avoid responsibility out of fatigue or fear?",
    "How can nurturing continue to enrich your later years?",
    "How do you find harmony between independence and connection?",
    "What lessons of responsibility still challenge you now?",
    "How can love and service bring you peace at this stage?"
  ],
  "7": [
    "How do you trust your inner wisdom more deeply in later life?",
    "Where do you still resist faith in life’s unfolding?",
    "How can solitude bring peace instead of loneliness now?",
    "What role does reflection play in your legacy?",
    "How do you balance logic with intuition at this stage?",
    "Where do you still doubt your spiritual insights?",
    "How can you find meaning in both stillness and connection?",
    "What lessons in faith are still unfolding for you?",
    "How do you handle feelings of separation in later years?",
    "How can spiritual awareness guide your aging process?"
  ],
  "8": [
    "How do you view power and success differently in later life?",
    "Where do you still struggle with financial balance?",
    "How can you release control and embrace trust now?",
    "What role does ambition play in your legacy?",
    "How do you handle authority as your own power shifts?",
    "Where do you still fear loss or failure?",
    "How can material mastery support your peace of mind?",
    "What lessons in integrity guide you now?",
    "How do you use influence for service rather than control?",
    "In what ways can generosity replace attachment at this stage?"
  ],
  "9": [
    "How do you practice letting go in your later years?",
    "Where do you still resist forgiveness?",
    "How can compassion guide your relationships now?",
    "What role does acceptance play in your peace of mind?",
    "How do you move forward when endings feel painful?",
    "Where do you hold onto past regrets or grief?",
    "How can service and kindness expand your fulfillment?",
    "What lessons in tolerance remain for you to practice?",
    "How do you prepare to leave a legacy of love?",
    "In what ways can universal love guide your final stage?"
  ],
  "11": [
    "How do you manage heightened sensitivity in later years?",
    "Where do you still struggle with balancing inspiration and practicality?",
    "How can intuition become a steady guide for peace?",
    "What lessons in trust remain for your inner guidance?",
    "How do you handle nervous energy as life slows down?",
    "Where do you still feel overwhelmed by spiritual responsibility?",
    "How can you use your vision to inspire others now?",
    "What role does inner peace play in your maturity?",
    "How do you release self-doubt at this stage of life?",
    "How can sensitivity become wisdom in your legacy?"
  ],
  "22": [
    "How do you handle the weight of past responsibilities in later life?",
    "Where do you still feel overwhelmed by expectations?",
    "How can you break big goals into peace and acceptance now?",
    "What role does service play in your fulfillment at this stage?",
    "How do you balance material and spiritual values in later years?",
    "Where do you still struggle with fears of failure?",
    "How can you pass on wisdom without carrying burdens?",
    "What lessons of discipline still serve you now?",
    "How do you release pressure and embrace peace?",
    "In what ways can your practical legacy inspire others?"
  ],
  "33": [
    "How do you balance giving and receiving love in later life?",
    "Where do you still feel over-responsible for others’ happiness?",
    "How can you nurture without self-sacrifice now?",
    "What lessons in unconditional love remain for you?",
    "How do you handle guilt tied to family or service?",
    "Where does perfectionism still limit your peace?",
    "How can compassion guide your legacy of service?",
    "What role does self-care play in your later years?",
    "How do you transform over-responsibility into wisdom?",
    "In what ways can your love uplift future generations?"
  ]
    },
    "KarmicDebtNumbers": {
   "13": [
    "In what ways does overworking affect your ability to stay balanced?",
    "How do repeated delays challenge your patience and focus?",
    "Where do you notice yourself losing perseverance when facing obstacles?",
    "How can steady effort help you overcome patterns of repeated failure?",
    "What situations show you the cost of ignoring discipline?",
    "How do you respond when hard work feels never-ending?",
    "What habits reveal your struggle with maintaining consistency?",
    "How can patience transform the frustration of slow progress?",
    "Where have you seen shortcuts lead to setbacks in your life?",
    "In what ways does balance between effort and rest strengthen your success?"
  ],
  "14": [
    "How do sudden changes test your sense of responsibility?",
    "Where does indulgence or excess distract you from progress?",
    "How do you experience instability when freedom is misused?",
    "What situations show you the cost of avoiding self-control?",
    "How can discipline protect your desire for independence?",
    "Where has escapism kept you from facing real challenges?",
    "In what ways do your choices reveal a struggle with balance?",
    "How have unpredictable shifts taught you responsibility?",
    "What lessons about freedom do you learn when you face consequences?",
    "How can moderation turn instability into steady growth?"
  ],
  "16": [
    "How does pride interfere with your ability to grow?",
    "Where have sudden downfalls reshaped your perspective?",
    "How do endings in relationships push you toward transformation?",
    "What situations reveal the cost of holding onto ego?",
    "How has betrayal taught you lessons about humility?",
    "Where do you resist letting go, even when change is necessary?",
    "How do losses create space for deeper self-awareness?",
    "What role does humility play in healing after disappointment?",
    "How have painful endings guided you toward spiritual growth?",
    "In what ways does surrendering control lead to wisdom?"
  ],
  "19": [
    "How do challenges with dependence push you toward independence?",
    "Where have you faced rejection that forced you to stand alone?",
    "How do struggles with isolation shape your sense of self-reliance?",
    "What situations reveal the misuse of power or authority in your life?",
    "How do you practice integrity when faced with difficult choices?",
    "Where do you resist stepping into leadership out of fear?",
    "How has lack of support challenged you to trust your own strength?",
    "What lessons about independence come through loneliness or loss?",
    "How do you balance using power with fairness and responsibility?",
    "In what ways can you lead by example when external support is missing?"
  ]
    }
  }
}